Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_sport_type.h
#ifndef _RTL8735B_SPORT_TYPE_H_
#define _RTL8735B_SPORT_TYPE_H_

/**************************************************************************//**
 * @defgroup SPORT_SP_TX_FIFO_0
 * @brief  SPORT TX FIFO Register                    (@ 0X000)
 * @{
 *****************************************************************************/
#define SPORT_SHIFT_SP_TX_FIFO_0                     0
#define SPORT_MASK_SP_TX_FIFO_0                      ((u32)0xFFFFFFFF << 0)                              /*!<W 0  TX FIFO 0 address */
/** @} */

/**************************************************************************//**
 * @defgroup SPORT_SP_CON
 * @brief  SPORT Control Register                    (@ 0X004)
 * @{
 *****************************************************************************/
#define SPORT_SHIFT_SP_MCLK_SEL                      30
#define SPORT_MASK_SP_MCLK_SEL                       ((u32)0x00000003 << 30)                             /*!<R/W 0  Select MCLK output 01 and 11: MCLK output = SP_SRC_CLK / 1 00: MCLK output = SP_SRC_CLK / 2 10: MCLK output = SP_SRC_CLK / 4 */
#define SPORT_SHIFT_SP_SEL_I2S_RX_CH                 28
#define SPORT_MASK_SP_SEL_I2S_RX_CH                  ((u32)0x00000003 << 28)                             /*!<R/W 0  Control L and R channel data for RX. 00: L/R 01: R/L 10: L/L 11: R/R Without TDM only */
#define SPORT_SHIFT_SP_SEL_I2S_TX_CH                 26
#define SPORT_MASK_SP_SEL_I2S_TX_CH                  ((u32)0x00000003 << 26)                             /*!<R/W 0  Control L and R channel data for TX. 00: L/R 01: R/L 10: L/L 11: R/R Without TDM only */
#define SPORT_SHIFT_SP_START_RX                      25
#define SPORT_BIT_SP_START_RX                        ((u32)0x00000001 << 25)                             /*!<R/W 0  Start RX. 0: RX is disabled 1: RX is started */
#define SPORT_SHIFT_SP_RX_DISABLE                    24
#define SPORT_BIT_SP_RX_DISABLE                      ((u32)0x00000001 << 24)                             /*!<R/W 1  SPORT RX control. 0: SPORT RX is enabled 1: SPORT RX is disabled */
#define SPORT_SHIFT_SP_RX_LSB_FIRST_0                23
#define SPORT_BIT_SP_RX_LSB_FIRST_0                  ((u32)0x00000001 << 23)                             /*!<R/W 0  MSB or LSB control for RX0. 0: MSB first 1: LSB first */
#define SPORT_SHIFT_SP_TX_LSB_FIRST_0                22
#define SPORT_BIT_SP_TX_LSB_FIRST_0                  ((u32)0x00000001 << 22)                             /*!<R/W 0  MSB or LSB control for TX0. 0: MSB first 1: LSB first */
#define SPORT_SHIFT_SP_TDM_MODE_SEL_RX               20
#define SPORT_MASK_SP_TDM_MODE_SEL_RX                ((u32)0x00000003 << 20)                             /*!<R/W 0  TDM RX channel control 00: Without TDM 01: 4 channels in the TDM mode 10: 6 channels in the TDM mode 11: 8 channels in the TDM mode */
#define SPORT_SHIFT_SP_TDM_MODE_SEL_TX               18
#define SPORT_MASK_SP_TDM_MODE_SEL_TX                ((u32)0x00000003 << 18)                             /*!<R/W 0  TDM TX channel control 00: Without TDM 01: 4 channels in the TDM mode 10: 6 channels in the TDM mode 11: 8 channels in the TDM mode */
#define SPORT_SHIFT_SP_START_TX                      17
#define SPORT_BIT_SP_START_TX                        ((u32)0x00000001 << 17)                             /*!<R/W 0  Start TX. 0: TX is disabled 1: TX is started */
#define SPORT_SHIFT_SP_TX_DISABLE                    16
#define SPORT_BIT_SP_TX_DISABLE                      ((u32)0x00000001 << 16)                             /*!<R/W 1  SPORT TX control. 0: SPORT TX is enabled 1: SPORT TX is disabled */
#define SPORT_SHIFT_SP_I2S_SELF_LPBK_EN              15
#define SPORT_BIT_SP_I2S_SELF_LPBK_EN                ((u32)0x00000001 << 15)                             /*!<R/W 0  Internal loopback mode. 0: Internal loopback mode is not enabled 1: Internal loopback mode is enabled */
#define SPORT_SHIFT_SP_DATA_LEN_SEL_TX_0             12
#define SPORT_MASK_SP_DATA_LEN_SEL_TX_0              ((u32)0x00000007 << 12)                             /*!<R/W 0  Set the TX0 data length 000: 16 bits 001: 20 bits 010: 24 bits 100: 32 bits Others: Reserved */
#define SPORT_SHIFT_SP_EN_I2S_MONO_TX_0              11
#define SPORT_BIT_SP_EN_I2S_MONO_TX_0                ((u32)0x00000001 << 11)                             /*!<R/W 0  Set mono or stereo for TX0 0: stereo 1: mono */
#define SPORT_SHIFT_SP_INV_I2S_SCLK                  10
#define SPORT_BIT_SP_INV_I2S_SCLK                    ((u32)0x00000001 << 10)                             /*!<R/W 0  Set bclk inverter 0: I2S and PCM sclk is not inverted 1: I2S and PCM sclk is inverted */
#define SPORT_SHIFT_SP_DATA_FORMAT_SEL_TX            8
#define SPORT_MASK_SP_DATA_FORMAT_SEL_TX             ((u32)0x00000003 << 8)                              /*!<R/W 0  Set data format 00: I2S 01: Left Justified 10: PCM mode A 11: PCM mode B */
#define SPORT_SHIFT_SP_MCU_CTL_MODE                  7
#define SPORT_BIT_SP_MCU_CTL_MODE                    ((u32)0x00000001 << 7)                              /*!<R/W 0  Select DMA mode or FIFO mode. 0: Internal DMA mode. 1: FIFO mode. */
#define SPORT_SHIFT_SP_LOOPBACK                      6
#define SPORT_BIT_SP_LOOPBACK                        ((u32)0x00000001 << 6)                              /*!<R/W 0  Self loopback mode. 0: Off. 1: Enable self loopback mode. */
#define SPORT_SHIFT_SP_WCLK_TX_INVERSE               5
#define SPORT_BIT_SP_WCLK_TX_INVERSE                 ((u32)0x00000001 << 5)                              /*!<R/W 0  Inverte I2S/PCM word clock for TX. 0: I2S/PCM word clock is not inverted 1: I2S/PCM word clock is inverted */
#define SPORT_SHIFT_SP_SLAVE_DATA_SEL                4
#define SPORT_BIT_SP_SLAVE_DATA_SEL                  ((u32)0x00000001 << 4)                              /*!<R/W 0  I2S or PCM slave for DATA path. 0: To be not an I2S or PCM slave 1: To be an I2S or PCM slave  */
#define SPORT_SHIFT_SP_SLAVE_CLK_SEL                 3
#define SPORT_BIT_SP_SLAVE_CLK_SEL                   ((u32)0x00000001 << 3)                              /*!<R/W 0  I2S or PCM slave for CLK path. 0: To be not an I2S or PCM slave 1: To be an I2S or PCM slave  */
#define SPORT_SHIFT_SP_RX_INV_I2S_SCLK               2
#define SPORT_BIT_SP_RX_INV_I2S_SCLK                 ((u32)0x00000001 << 2)                              /*!<R/W 0  Sclk to RX path is inverted. 0: sclk to RX path is not inverted. 1: sclk to RX path is inverted. */
#define SPORT_SHIFT_SP_TX_INV_I2S_SCLK               1
#define SPORT_BIT_SP_TX_INV_I2S_SCLK                 ((u32)0x00000001 << 1)                              /*!<R/W 0  Sclk to TX path is inverted. 0: sclk to TX path is not inverted. 1: sclk to TX path is inverted. */
#define SPORT_SHIFT_SP_RESET                         0
#define SPORT_BIT_SP_RESET                           ((u32)0x00000001 << 0)                              /*!<R/W 0  Reset SPORT0 module 0: disable reset 1: reset SPORT0 module. Write 1 first and then write 0. */
/** @} */

/**************************************************************************//**
 * @defgroup SPORT_SP_FIFO_EN_CLK_CON
 * @brief   SPORT FIFO Enable and Clock Control Register (@ 0X008)
 * @{
 *****************************************************************************/
#define SPORT_SHIFT_SP_RX_FIFO_1_CH6_7_EN            31
#define SPORT_BIT_SP_RX_FIFO_1_CH6_7_EN              ((u32)0x00000001 << 31)                             /*!<R/W 0  0: Disable 1: Enable the CH6 and CH7 of RX_FIFO_1 */
#define SPORT_SHIFT_SP_RX_FIFO_1_CH4_5_EN            30
#define SPORT_BIT_SP_RX_FIFO_1_CH4_5_EN              ((u32)0x00000001 << 30)                             /*!<R/W 0  0: Disable 1: Enable the CH4 and CH5 of RX_FIFO_1 */
#define SPORT_SHIFT_SP_RX_FIFO_0_CH2_3_EN            29
#define SPORT_BIT_SP_RX_FIFO_0_CH2_3_EN              ((u32)0x00000001 << 29)                             /*!<R/W 0  0: Disable 1: Enable the CH2 and CH3 of RX_FIFO_0 */
#define SPORT_SHIFT_SP_RX_FIFO_0_CH0_1_EN            28
#define SPORT_BIT_SP_RX_FIFO_0_CH0_1_EN              ((u32)0x00000001 << 28)                             /*!<R/W 1  0: Disable 1: Enable the CH0 and CH1 of RX_FIFO_0 */
#define SPORT_SHIFT_SP_TX_FIFO_1_CH6_7_EN            27
#define SPORT_BIT_SP_TX_FIFO_1_CH6_7_EN              ((u32)0x00000001 << 27)                             /*!<R/W 0  0: Disable 1: Enable the CH6 and CH7 of TX_FIFO_1 */
#define SPORT_SHIFT_SP_TX_FIFO_1_CH4_5_EN            26
#define SPORT_BIT_SP_TX_FIFO_1_CH4_5_EN              ((u32)0x00000001 << 26)                             /*!<R/W 0  0: Disable 1: Enable the CH4 and CH5 of TX_FIFO_1 */
#define SPORT_SHIFT_SP_TX_FIFO_0_CH2_3_EN            25
#define SPORT_BIT_SP_TX_FIFO_0_CH2_3_EN              ((u32)0x00000001 << 25)                             /*!<R/W 0  0: Disable 1: Enable the CH2 and CH3 of TX_FIFO_0 */
#define SPORT_SHIFT_SP_TX_FIFO_0_CH0_1_EN            24
#define SPORT_BIT_SP_TX_FIFO_0_CH0_1_EN              ((u32)0x00000001 << 24)                             /*!<R/W 1  0: Disable 1: Enable the CH0 and CH1 of TX_FIFO_0 */
#define SPORT_SHIFT_SP_RX_SNK_LR_SWAP_0              23
#define SPORT_BIT_SP_RX_SNK_LR_SWAP_0                ((u32)0x00000001 << 23)                             /*!<R/W 0  0: Disable 1: Swap L/R audio samples written to the sink memory of RX_FIFO_0 */
#define SPORT_SHIFT_SP_RX_SNK_BYTE_SWAP_0            22
#define SPORT_BIT_SP_RX_SNK_BYTE_SWAP_0              ((u32)0x00000001 << 22)                             /*!<R/W 0  0: Disable 1: Swap H/L bytes written to the sink memory of RX_FIFO_0 */
#define SPORT_SHIFT_SP_TX_SRC_LR_SWAP_0              21
#define SPORT_BIT_SP_TX_SRC_LR_SWAP_0                ((u32)0x00000001 << 21)                             /*!<R/W 0  0: Disable 1: Swap L/R audio samples read from the source memory of TX_FIFO_0 */
#define SPORT_SHIFT_SP_TX_SRC_BYTE_SWAP_0            20
#define SPORT_BIT_SP_TX_SRC_BYTE_SWAP_0              ((u32)0x00000001 << 20)                             /*!<R/W 0  0: Disable 1: Swap H/L bytes read from the source memory of TX_FIFO_0 */
#define SPORT_SHIFT_SP_CLK_SEL                       14
#define SPORT_MASK_SP_CLK_SEL                        ((u32)0x00000003 << 14)                             /*!<R/W 0  00 and 01: SP_CLK = SP_SRC_CLK 10: SP_CLK = SP_SRC_CLK / 2 11: SP_CLK = SP_SRC_CLK / 4 */
#define SPORT_SHIFT_SP_CLEAR_RX_ERR_CNT              13
#define SPORT_BIT_SP_CLEAR_RX_ERR_CNT                ((u32)0x00000001 << 13)                             /*!<R/W 0  Write 1 and then write 0 to clear RX error counter. */
#define SPORT_SHIFT_SP_CLEAR_TX_ERR_CNT              12
#define SPORT_BIT_SP_CLEAR_TX_ERR_CNT                ((u32)0x00000001 << 12)                             /*!<R/W 0  Write 1 and then write 0 to clear TX error counter. */
#define SPORT_SHIFT_SP_ENABLE_MCLK                   11
#define SPORT_BIT_SP_ENABLE_MCLK                     ((u32)0x00000001 << 11)                             /*!<R/W 0  0: Disable 1: Enable MCLK */
#define SPORT_SHIFT_SP_DEBUG_BUS_SEL                 8
#define SPORT_MASK_SP_DEBUG_BUS_SEL                  ((u32)0x00000007 << 8)                              /*!<R/W 0  000: Debug_bus_a 001: Debug_bus_b ect. */
#define SPORT_SHIFT_SP_RX_FIFO_RESET                 2
#define SPORT_BIT_SP_RX_FIFO_RESET                   ((u32)0x00000001 << 2)                              /*!<R/W 0  0: Stop reset 1: Reset RX FIFO to make TX FIFO data become zero */
#define SPORT_SHIFT_SP_TX_FIFO_RESET                 1
#define SPORT_BIT_SP_TX_FIFO_RESET                   ((u32)0x00000001 << 1)                              /*!<R/W 0  0: Stop reset 1: Reset TX FIFO to make TX FIFO data become zero */
#define SPORT_SHIFT_SP_BCLK_RESET                    0
#define SPORT_BIT_SP_BCLK_RESET                      ((u32)0x00000001 << 0)                              /*!<R/W 0  0: Stop reset 1: Stop BCLK, and reset the state machine of the clock generator. */
/** @} */

/**************************************************************************//**
 * @defgroup SPORT_SP_FIFO_INTR_CON
 * @brief  SPORT FIFO Interrupt Control Register     (@ 0X00C)
 * @{
 *****************************************************************************/
#define SPORT_SHIFT_SP_TX_IDLE_INTR_1_EN             30
#define SPORT_BIT_SP_TX_IDLE_INTR_1_EN               ((u32)0x00000001 << 30)                             /*!<R/W 0  0: Disable 1: Generate the interrupt when TX is working, and TX FIFO_1 is empty. */
#define SPORT_SHIFT_SP_RX_FIFO_EMPTY_1_EN            29
#define SPORT_BIT_SP_RX_FIFO_EMPTY_1_EN              ((u32)0x00000001 << 29)                             /*!<R/W 0  0: Disable 1: Enable RX FIFO_1 empty interrupt */
#define SPORT_SHIFT_SP_TX_FIFO_EMPTY_1_EN            28
#define SPORT_BIT_SP_TX_FIFO_EMPTY_1_EN              ((u32)0x00000001 << 28)                             /*!<R/W 0  0: Disable 1: Enable TX FIFO_1 empty interrupt */
#define SPORT_SHIFT_SP_RX_FIFO_FULL_INTR_1_EN        27
#define SPORT_BIT_SP_RX_FIFO_FULL_INTR_1_EN          ((u32)0x00000001 << 27)                             /*!<R/W 0  0: Disable 1: Enable RX FIFO_1 full interrupt */
#define SPORT_SHIFT_SP_TX_FIFO_FULL_INTR_1_EN        26
#define SPORT_BIT_SP_TX_FIFO_FULL_INTR_1_EN          ((u32)0x00000001 << 26)                             /*!<R/W 0  0: Disable 1: Enable TX FIFO_1 full interrupt */
#define SPORT_SHIFT_SP_RX_FIFO_TH_INTR_1_EN          25
#define SPORT_BIT_SP_RX_FIFO_TH_INTR_1_EN            ((u32)0x00000001 << 25)                             /*!<R/W 0  0: Disable 1: When RX FIFO_1 level is greater than SP_RX_FIFO_TH, generate the interrupt. */
#define SPORT_SHIFT_SP_TX_FIFO_TH_INTR_1_EN          24
#define SPORT_BIT_SP_TX_FIFO_TH_INTR_1_EN            ((u32)0x00000001 << 24)                             /*!<R/W 0  0: Disable 1: When TX FIFO_1 level is less than SP_TX_FIFO_TH, generate the interrupt. */
#define SPORT_SHIFT_SP_TX_IDLE_INTR_0_EN             22
#define SPORT_BIT_SP_TX_IDLE_INTR_0_EN               ((u32)0x00000001 << 22)                             /*!<R/W 0  0: Disable 1: Generate the interrupt when TX is working, and TX FIFO_0 is empty. */
#define SPORT_SHIFT_SP_RX_FIFO_EMPTY_0_EN            21
#define SPORT_BIT_SP_RX_FIFO_EMPTY_0_EN              ((u32)0x00000001 << 21)                             /*!<R/W 0  0: Disable 1: Enable RX FIFO_0 empty interrupt */
#define SPORT_SHIFT_SP_TX_FIFO_EMPTY_0_EN            20
#define SPORT_BIT_SP_TX_FIFO_EMPTY_0_EN              ((u32)0x00000001 << 20)                             /*!<R/W 0  0: Disable 1: Enable TX FIFO_0 empty interrupt */
#define SPORT_SHIFT_SP_RX_FIFO_FULL_INTR_0_EN        19
#define SPORT_BIT_SP_RX_FIFO_FULL_INTR_0_EN          ((u32)0x00000001 << 19)                             /*!<R/W 0  0: Disable 1: Enable RX FIFO_0 full interrupt */
#define SPORT_SHIFT_SP_TX_FIFO_FULL_INTR_0_EN        18
#define SPORT_BIT_SP_TX_FIFO_FULL_INTR_0_EN          ((u32)0x00000001 << 18)                             /*!<R/W 0  0: Disable 1: Enable TX FIFO_0 full interrupt */
#define SPORT_SHIFT_SP_RX_FIFO_TH_INTR_0_EN          17
#define SPORT_BIT_SP_RX_FIFO_TH_INTR_0_EN            ((u32)0x00000001 << 17)                             /*!<R/W 0  0: Disable 1: When RX FIFO_0 level is greater than SP_RX_FIFO_TH, generate the interrupt. */
#define SPORT_SHIFT_SP_TX_FIFO_TH_INTR_0_EN          16
#define SPORT_BIT_SP_TX_FIFO_TH_INTR_0_EN            ((u32)0x00000001 << 16)                             /*!<R/W 0  0: Disable 1: When TX FIFO_0 level is less than SP_TX_FIFO_TH, generate the interrupt. */
#define SPORT_SHIFT_SP_CLR_TX_IDLE_INTR_1            13
#define SPORT_BIT_SP_CLR_TX_IDLE_INTR_1              ((u32)0x00000001 << 13)                             /*!<R/W 0  Clear TX FIFO_1 idle interrupt. F/W writes 1 and then 0 to clear TX interrupt. */
#define SPORT_SHIFT_SP_CLR_RX_FIFO_EMPTY_1           12
#define SPORT_BIT_SP_CLR_RX_FIFO_EMPTY_1             ((u32)0x00000001 << 12)                             /*!<R/W 0  Clear RX FIFO_1 empty interrupt. F/W writes 1 and then 0 to clear RX interrupt. */
#define SPORT_SHIFT_SP_CLR_TX_FIFO_EMPTY_1           11
#define SPORT_BIT_SP_CLR_TX_FIFO_EMPTY_1             ((u32)0x00000001 << 11)                             /*!<R/W 0  Clear TX FIFO_1 empty interrupt. F/W writes 1 and then 0 to clear TX interrupt. */
#define SPORT_SHIFT_SP_CLR_RX_FIFO_FULL_INTR_1       10
#define SPORT_BIT_SP_CLR_RX_FIFO_FULL_INTR_1         ((u32)0x00000001 << 10)                             /*!<R/W 0  Clear RX FIFO_1 full interrupt. F/W writes 1 and then 0 to clear RX interrupt. */
#define SPORT_SHIFT_SP_CLR_TX_FIFO_FULL_INTR_1       9
#define SPORT_BIT_SP_CLR_TX_FIFO_FULL_INTR_1         ((u32)0x00000001 << 9)                              /*!<R/W 0  Clear TX FIFO_1 full interrupt. F/W writes 1 and then 0 to clear TX interrupt. */
#define SPORT_SHIFT_SP_CLR_RX_FIFO_TH_INTR_1         8
#define SPORT_BIT_SP_CLR_RX_FIFO_TH_INTR_1           ((u32)0x00000001 << 8)                              /*!<R/W 0  For MCU mode (bypass DMA), F/W writes 1 and then 0 to clear RX interrupt. Note: RX interrupt is to indicate that MCU can get audio data from RX FIFO_1 */
#define SPORT_SHIFT_SP_CLR_TX_FIFO_TH_INTR_1         7
#define SPORT_BIT_SP_CLR_TX_FIFO_TH_INTR_1           ((u32)0x00000001 << 7)                              /*!<R/W 0  For MCU mode (bypass DMA), F/W writes 1 and then 0 to clear RX interrupt. Note: TX interrupt is to indicate that MCU can write audio data to TX FIFO_1 */
#define SPORT_SHIFT_SP_CLR_TX_IDLE_INTR_0            6
#define SPORT_BIT_SP_CLR_TX_IDLE_INTR_0              ((u32)0x00000001 << 6)                              /*!<R/W 0  Clear TX FIFO_0 idle interrupt. F/W writes 1 and then 0 to clear TX interrupt. */
#define SPORT_SHIFT_SP_CLR_RX_FIFO_EMPTY_0           5
#define SPORT_BIT_SP_CLR_RX_FIFO_EMPTY_0             ((u32)0x00000001 << 5)                              /*!<R/W 0  Clear RX FIFO_0 empty interrupt. F/W writes 1 and then 0 to clear RX interrupt. */
#define SPORT_SHIFT_SP_CLR_TX_FIFO_EMPTY_0           4
#define SPORT_BIT_SP_CLR_TX_FIFO_EMPTY_0             ((u32)0x00000001 << 4)                              /*!<R/W 0  Clear TX FIFO_0 empty interrupt. F/W writes 1 and then 0 to clear TX interrupt. */
#define SPORT_SHIFT_SP_CLR_RX_FIFO_FULL_INTR_0       3
#define SPORT_BIT_SP_CLR_RX_FIFO_FULL_INTR_0         ((u32)0x00000001 << 3)                              /*!<R/W 0  Clear RX FIFO_0 full interrupt. F/W writes 1 and then 0 to clear RX interrupt. */
#define SPORT_SHIFT_SP_CLR_TX_FIFO_FULL_INTR_0       2
#define SPORT_BIT_SP_CLR_TX_FIFO_FULL_INTR_0         ((u32)0x00000001 << 2)                              /*!<R/W 0  Clear TX FIFO_0 full interrupt. F/W writes 1 and then 0 to clear TX interrupt. */
#define SPORT_SHIFT_SP_CLR_RX_FIFO_TH_INTR_0         1
#define SPORT_BIT_SP_CLR_RX_FIFO_TH_INTR_0           ((u32)0x00000001 << 1)                              /*!<R/W 0  For MCU mode (bypass DMA), F/W writes 1 and then 0 to clear RX interrupt. Note: RX interrupt is to indicate that MCU can get audio data from RX FIFO_0 */
#define SPORT_SHIFT_SP_CLR_TX_FIFO_TH_INTR_0         0
#define SPORT_BIT_SP_CLR_TX_FIFO_TH_INTR_0           ((u32)0x00000001 << 0)                              /*!<R/W 0  For MCU mode (bypass DMA), F/W writes 1 and then 0 to clear RX interrupt. Note: TX interrupt is to indicate that MCU can write audio data to TX FIFO_0 */
/** @} */

/**************************************************************************//**
 * @defgroup SPORT_SP_RX_FIFO_0
 * @brief  SPORT RX FIFO_0 Register                  (@ 0X010)
 * @{
 *****************************************************************************/
#define SPORT_SHIFT_SP_RX_FIFO_0                     0
#define SPORT_MASK_SP_RX_FIFO_0                      ((u32)0xFFFFFFFF << 0)                              /*!<R 0  RX FIFO_0 data register */
/** @} */

/**************************************************************************//**
 * @defgroup SPORT_SP_FIFO_CNT_STA
 * @brief  SPORT FIFO Counter Status Register        (@ 0X014)
 * @{
 *****************************************************************************/
#define SPORT_SHIFT_SP_RX_DEPTH_CNT_1                24
#define SPORT_MASK_SP_RX_DEPTH_CNT_1                 ((u32)0x0000003F << 24)                             /*!<R 0  Read RX FIFO_1 depth status. When RX FIFO_1 is empty, this value shows 32. */
#define SPORT_SHIFT_SP_TX_DEPTH_CNT_1                16
#define SPORT_MASK_SP_TX_DEPTH_CNT_1                 ((u32)0x0000003F << 16)                             /*!<R 0  Read TX FIFO_1 depth status. When TX FIFO_1 is empty, this value shows 32. */
#define SPORT_SHIFT_SP_RX_DEPTH_CNT_0                8
#define SPORT_MASK_SP_RX_DEPTH_CNT_0                 ((u32)0x0000003F << 8)                              /*!<R 0  Read RX FIFO_0 depth status. When RX FIFO_0 is empty, this value shows 32. */
#define SPORT_SHIFT_SP_TX_DEPTH_CNT_0                0
#define SPORT_MASK_SP_TX_DEPTH_CNT_0                 ((u32)0x0000003F << 0)                              /*!<R 0  Read TX FIFO_0 depth status. When TX FIFO_0 is empty, this value shows 32. */
/** @} */

/**************************************************************************//**
 * @defgroup SPORT_SP_TX_RX_ERR_STA
 * @brief  SPORT TX and RX Error Status Register     (@ 0X018)
 * @{
 *****************************************************************************/
#define SPORT_SHIFT_SP_RX_ERR_CNT                    16
#define SPORT_MASK_SP_RX_ERR_CNT                     ((u32)0x0000FFFF << 16)                             /*!<R 0  RX error counter Note: This counter should always be zero if everything works well. */
#define SPORT_SHIFT_SP_TX_ERR_CNT                    0
#define SPORT_MASK_SP_TX_ERR_CNT                     ((u32)0x0000FFFF << 0)                              /*!<R 0  TX error counter Note: This counter should always be zero if everything works well. */
/** @} */

/**************************************************************************//**
 * @defgroup SPORT_SP_TX_FRA_DIV
 * @brief  SPORT TX Fractional Divider Register      (@ 0X01C)
 * @{
 *****************************************************************************/
#define SPORT_SHIFT_SP_TX_MI_NI_UPDATE               31
#define SPORT_BIT_SP_TX_MI_NI_UPDATE                 ((u32)0x00000001 << 31)                             /*!<R/W 0  Update mi and ni. 0: Off 1: To update mi and ni to get the new clock rate. This bit will be reset automatically when the update is done. */
#define SPORT_SHIFT_SP_TX_NI                         16
#define SPORT_MASK_SP_TX_NI                          ((u32)0x00007FFF << 16)                             /*!<R/W 0x30  the same mi  */
#define SPORT_SHIFT_SP_TX_MI                         0
#define SPORT_MASK_SP_TX_MI                          ((u32)0x0000FFFF << 0)                              /*!<R/W 0x271  BCLK = 40MHz x (ni/mi) For example: BCLK=3.072MHz=40MHz x (48/625) */
/** @} */

