Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_sport_type.h
/**************************************************************************//**
 * @defgroup SPORT_SP_LRCK_FIFO_TH_CON
 * @brief   SPORT LRCK and FIFO Threshold Control Register (@ 0X020)
 * @{
 *****************************************************************************/
#define SPORT_SHIFT_SP_RX_BCLK_DIV_RATIO             24
#define SPORT_MASK_SP_RX_BCLK_DIV_RATIO              ((u32)0x000000FF << 24)                             /*!<R/W 0x3F  Control RX LRCK divider. */
#define SPORT_SHIFT_SP_BCLK_DIV_RATIO                16
#define SPORT_MASK_SP_BCLK_DIV_RATIO                 ((u32)0x000000FF << 16)                             /*!<R/W 0x3F  Control LRCK divider. */
#define SPORT_SHIFT_SP_RX_FIFO_TH                    8
#define SPORT_MASK_SP_RX_FIFO_TH                     ((u32)0x0000003F << 8)                              /*!<R/W 0x10  Set RX FIFO interrupt and DMA request threshold. */
#define SPORT_SHIFT_SP_TX_FIFO_TH                    0
#define SPORT_MASK_SP_TX_FIFO_TH                     ((u32)0x0000003F << 0)                              /*!<R/W 0x10  Set TX FIFO interrupt and DMA request threshold. */
/** @} */

/**************************************************************************//**
 * @defgroup SPORT_SP_FIFO_INTR_STA
 * @brief  SPORT FIFO Interrupt Status Register      (@ 0X024)
 * @{
 *****************************************************************************/
#define SPORT_SHIFT_SP_RX_FIFO_EMPTY_0               31
#define SPORT_BIT_SP_RX_FIFO_EMPTY_0                 ((u32)0x00000001 << 31)                             /*!<R 1  RX FIFO raw status 1: RX FIFO_0 is empty */
#define SPORT_SHIFT_SP_TX_FIFO_EMPTY_0               30
#define SPORT_BIT_SP_TX_FIFO_EMPTY_0                 ((u32)0x00000001 << 30)                             /*!<R 1  TX FIFO raw status 1: TX FIFO_0 is empty */
#define SPORT_SHIFT_SP_RX_FIFO_FULL_0                29
#define SPORT_BIT_SP_RX_FIFO_FULL_0                  ((u32)0x00000001 << 29)                             /*!<R 0  RX FIFO raw status 1: RX FIFO_0 is full  */
#define SPORT_SHIFT_SP_TX_FIFO_FULL_0                28
#define SPORT_BIT_SP_TX_FIFO_FULL_0                  ((u32)0x00000001 << 28)                             /*!<R 0  TX FIFO raw status 1: TX FIFO_0 is full */
#define SPORT_SHIFT_SP_RX_FIFO_EMPTY_1               27
#define SPORT_BIT_SP_RX_FIFO_EMPTY_1                 ((u32)0x00000001 << 27)                             /*!<R 1  RX FIFO raw status 1: RX FIFO_1 is empty */
#define SPORT_SHIFT_SP_TX_FIFO_EMPTY_1               26
#define SPORT_BIT_SP_TX_FIFO_EMPTY_1                 ((u32)0x00000001 << 26)                             /*!<R 1  TX FIFO raw status 1: TX FIFO_1 is empty */
#define SPORT_SHIFT_SP_RX_FIFO_FULL_1                25
#define SPORT_BIT_SP_RX_FIFO_FULL_1                  ((u32)0x00000001 << 25)                             /*!<R 0  RX FIFO raw status 1: RX FIFO_1 is full */
#define SPORT_SHIFT_SP_TX_FIFO_FULL_1                24
#define SPORT_BIT_SP_TX_FIFO_FULL_1                  ((u32)0x00000001 << 24)                             /*!<R 0  TX FIFO raw status 1: TX FIFO_1 is full  */
#define SPORT_SHIFT_SP_TX_IDLE_INTR_1                13
#define SPORT_BIT_SP_TX_IDLE_INTR_1                  ((u32)0x00000001 << 13)                             /*!<R 0  Interrupt status 1: TX is working but FIFO_1 is empty.  */
#define SPORT_SHIFT_SP_RX_FIFO_EMPTY_INTR_1          12
#define SPORT_BIT_SP_RX_FIFO_EMPTY_INTR_1            ((u32)0x00000001 << 12)                             /*!<R 0  Interrupt status 1: RX FIFO_1 is empty */
#define SPORT_SHIFT_SP_TX_FIFO_EMPTY_INTR_1          11
#define SPORT_BIT_SP_TX_FIFO_EMPTY_INTR_1            ((u32)0x00000001 << 11)                             /*!<R 0  Interrupt status 1: TX FIFO_1 is empty */
#define SPORT_SHIFT_SP_RX_FIFO_FULL_INTR_1           10
#define SPORT_BIT_SP_RX_FIFO_FULL_INTR_1             ((u32)0x00000001 << 10)                             /*!<R 0  Interrupt status 1: RX FIFO_1 is full */
#define SPORT_SHIFT_SP_TX_FIFO_FULL_INTR_1           9
#define SPORT_BIT_SP_TX_FIFO_FULL_INTR_1             ((u32)0x00000001 << 9)                              /*!<R 0  Interrupt status 1: TX FIFO_1 is full */
#define SPORT_SHIFT_SP_RX_FIFO_TH_INTR_1             8
#define SPORT_BIT_SP_RX_FIFO_TH_INTR_1               ((u32)0x00000001 << 8)                              /*!<R 0  Interrupt status 1: It is ready to receive data */
#define SPORT_SHIFT_SP_TX_FIFO_TH_INTR_1             7
#define SPORT_BIT_SP_TX_FIFO_TH_INTR_1               ((u32)0x00000001 << 7)                              /*!<R 0  Interrupt status 1: It is ready to send data out */
#define SPORT_SHIFT_SP_TX_IDLE_INTR_0                6
#define SPORT_BIT_SP_TX_IDLE_INTR_0                  ((u32)0x00000001 << 6)                              /*!<R 0  Interrupt status 1: TX is working but FIFO_0 is empty. */
#define SPORT_SHIFT_SP_RX_FIFO_EMPTY_INTR_0          5
#define SPORT_BIT_SP_RX_FIFO_EMPTY_INTR_0            ((u32)0x00000001 << 5)                              /*!<R 0  Interrupt status 1: TX FIFO_0 is empty */
#define SPORT_SHIFT_SP_TX_FIFO_EMPTY_INTR_0          4
#define SPORT_BIT_SP_TX_FIFO_EMPTY_INTR_0            ((u32)0x00000001 << 4)                              /*!<R 0  Interrupt status 1: TX FIFO_0 is empty */
#define SPORT_SHIFT_SP_RX_FIFO_FULL_INTR_0           3
#define SPORT_BIT_SP_RX_FIFO_FULL_INTR_0             ((u32)0x00000001 << 3)                              /*!<R 0  Interrupt status 1: RX FIFO_0 is full */
#define SPORT_SHIFT_SP_TX_FIFO_FULL_INTR_0           2
#define SPORT_BIT_SP_TX_FIFO_FULL_INTR_0             ((u32)0x00000001 << 2)                              /*!<R 0  Interrupt status 1: TX FIFO_0 is full */
#define SPORT_SHIFT_SP_RX_FIFO_TH_INTR_0             1
#define SPORT_BIT_SP_RX_FIFO_TH_INTR_0               ((u32)0x00000001 << 1)                              /*!<R 0  Interrupt status 1: It is ready to send data out */
#define SPORT_SHIFT_SP_TX_FIFO_TH_INTR_0             0
#define SPORT_BIT_SP_TX_FIFO_TH_INTR_0               ((u32)0x00000001 << 0)                              /*!<R 0  Interrupt status 1: It is ready to send data out */
/** @} */

/**************************************************************************//**
 * @defgroup SPORT_SP_FORM_CON
 * @brief   SPORT Format Control                     (@ 0X028)
 * @{
 *****************************************************************************/
#define SPORT_SHIFT_SP_TRX_SAME_CH_LEN               31
#define SPORT_BIT_SP_TRX_SAME_CH_LEN                 ((u32)0x00000001 << 31)                             /*!<R/W 0  0: TX and RX channel length according to SP_CH_LEN_SEL_RX and SP_CH_LEN_SEL_RX. 1: Force that TX and RX have the same channel length */
#define SPORT_SHIFT_SP_CH_LEN_SEL_RX                 28
#define SPORT_MASK_SP_CH_LEN_SEL_RX                  ((u32)0x00000007 << 28)                             /*!<R/W 0x4  Set RX channel length. 000: 16 bits 001: 20 bits 010: 24 bits 100: 32 bits Others: Reserved */
#define SPORT_SHIFT_SP_CH_LEN_SEL_TX                 24
#define SPORT_MASK_SP_CH_LEN_SEL_TX                  ((u32)0x00000007 << 24)                             /*!<R/W 0x4  Set TX channel length. 000: 16 bits 001: 20 bits 010: 24 bits 100: 32 bits Others: Reserved */
#define SPORT_SHIFT_SP_DATA_LEN_SEL_RX_0             12
#define SPORT_MASK_SP_DATA_LEN_SEL_RX_0              ((u32)0x00000007 << 12)                             /*!<R/W 0  It is valid if SP_TRX_SAME_FS is 0. Data length of SD_I 000: 16 bits 001: 20 bits 010: 24 bits 100: 32 bits Others: Reserved */
#define SPORT_SHIFT_SP_EN_I2S_MONO_RX_0              11
#define SPORT_BIT_SP_EN_I2S_MONO_RX_0                ((u32)0x00000001 << 11)                             /*!<R/W 0  It is valid if SP_TRX_SAME_FS is 0. Data format of SD_I 0: stereo 1: mono */
#define SPORT_SHIFT_SP_TRX_SAME_LRCK                 10
#define SPORT_BIT_SP_TRX_SAME_LRCK                   ((u32)0x00000001 << 10)                             /*!<R/W 0  0: LRCK_RX is not as same as LRCK 1: LRCK_RX is as same as LRCK */
#define SPORT_SHIFT_SP_DATA_FORMAT_SEL_RX            8
#define SPORT_MASK_SP_DATA_FORMAT_SEL_RX             ((u32)0x00000003 << 8)                              /*!<R/W 0  It is valid if SP_TRX_SAME_FS is 0. Data format of SD_I 00: I2S 01: Left Justified 10: PCM mode A 11: PCM mode B */
#define SPORT_SHIFT_SP_FIXED_BCLK                    7
#define SPORT_BIT_SP_FIXED_BCLK                      ((u32)0x00000001 << 7)                              /*!<R/W 0  0: Disable the fixed BCLK 1: Enable the fixed BCLK */
#define SPORT_SHIFT_SP_FIXED_BCLK_SEL                6
#define SPORT_BIT_SP_FIXED_BCLK_SEL                  ((u32)0x00000001 << 6)                              /*!<R/W 0  0: BCLK is fixed at SP_CLK / 4 1: BCLK is fixed at SP_CLK / 2 */
#define SPORT_SHIFT_SP_BCLK_RX_INVERSE               5
#define SPORT_BIT_SP_BCLK_RX_INVERSE                 ((u32)0x00000001 << 5)                              /*!<R/W 0  0: Disable 1: Invert the phase of LRCK_RX */
#define SPORT_SHIFT_SP_BCLK_OUT_INVERSE              3
#define SPORT_BIT_SP_BCLK_OUT_INVERSE                ((u32)0x00000001 << 3)                              /*!<R/W 0  0: Disable 1: Invert the phase of BCLK */
#define SPORT_SHIFT_SP_TRX_SAME_LENGTH               2
#define SPORT_BIT_SP_TRX_SAME_LENGTH                 ((u32)0x00000001 << 2)                              /*!<R/W 0x1  0: Do not have the same data length. 1: Have the same data length. */
#define SPORT_SHIFT_SP_TRX_SAME_CH                   1
#define SPORT_BIT_SP_TRX_SAME_CH                     ((u32)0x00000001 << 1)                              /*!<R/W 0x1  0: Do not have the same channel setting. 1: Have the same channel setting. Both are either stereo or mono. */
#define SPORT_SHIFT_SP_TRX_SAME_FS                   0
#define SPORT_BIT_SP_TRX_SAME_FS                     ((u32)0x00000001 << 0)                              /*!<R/W 0x1  Support TX and RX use different sample rates. 0: TX and RX do not have the same sampling rate 1: TX and RX have the same sampling rate */
/** @} */

/**************************************************************************//**
 * @defgroup SPORT_SP_RX_FRA_DIV
 * @brief  SPORT RX Fractional Divider Register      (@ 0X02C)
 * @{
 *****************************************************************************/
#define SPORT_SHIFT_SP_RX_MI_NI_UPDATE               31
#define SPORT_BIT_SP_RX_MI_NI_UPDATE                 ((u32)0x00000001 << 31)                             /*!<R/W 0  Update mi and ni. 0: Off 1: To update mi and ni to get the new clock rate. This bit will be reset automatically when the update is done. */
#define SPORT_SHIFT_SP_RX_NI                         16
#define SPORT_MASK_SP_RX_NI                          ((u32)0x00007FFF << 16)                             /*!<R/W 0x30  the same mi  */
#define SPORT_SHIFT_SP_RX_MI                         0
#define SPORT_MASK_SP_RX_MI                          ((u32)0x0000FFFF << 0)                              /*!<R/W 0x271  This fractional Divider mainly makes LRCK_RX. BCLK = 40MHz x (ni/mi) For example: BCLK=3.072MHz=40MHz x (48/625) */
/** @} */

/**************************************************************************//**
 * @defgroup SPORT_SP_TX_SLOT_SELE
 * @brief  SPORT TX Slot Selection Register          (@ 0X03C)
 * @{
 *****************************************************************************/
#define SPORT_SHIFT_SP_TX_SLOT7_SEL                  28
#define SPORT_MASK_SP_TX_SLOT7_SEL                   ((u32)0x00000007 << 28)                             /*!<R/W 0x7  Select the data of slot 7. 0: CH0 Data 1: CH1 Data 2: CH2 Data 3: CH3 Data 4: CH4 Data 5: CH5 Data 6: CH6 Data 7: CH7 Data */
#define SPORT_SHIFT_SP_TX_SLOT6_SEL                  24
#define SPORT_MASK_SP_TX_SLOT6_SEL                   ((u32)0x00000007 << 24)                             /*!<R/W 0x6  Select the data of slot 6. 0: CH0 Data 1: CH1 Data 2: CH2 Data 3: CH3 Data 4: CH4 Data 5: CH5 Data 6: CH6 Data 7: CH7 Data */
#define SPORT_SHIFT_SP_TX_SLOT5_SEL                  20
#define SPORT_MASK_SP_TX_SLOT5_SEL                   ((u32)0x00000007 << 20)                             /*!<R/W 0x5  Select the data of slot 5. 0: CH0 Data 1: CH1 Data 2: CH2 Data 3: CH3 Data 4: CH4 Data 5: CH5 Data 6: CH6 Data 7: CH7 Data */
#define SPORT_SHIFT_SP_TX_SLOT4_SEL                  16
#define SPORT_MASK_SP_TX_SLOT4_SEL                   ((u32)0x00000007 << 16)                             /*!<R/W 0x4  Select the data of slot 4. 0: CH0 Data 1: CH1 Data 2: CH2 Data 3: CH3 Data 4: CH4 Data 5: CH5 Data 6: CH6 Data 7: CH7 Data */
#define SPORT_SHIFT_SP_TX_SLOT3_SEL                  12
#define SPORT_MASK_SP_TX_SLOT3_SEL                   ((u32)0x00000007 << 12)                             /*!<R/W 0x3  Select the data of slot 3. 0: CH0 Data 1: CH1 Data 2: CH2 Data 3: CH3 Data 4: CH4 Data 5: CH5 Data 6: CH6 Data 7: CH7 Data */
#define SPORT_SHIFT_SP_TX_SLOT2_SEL                  8
#define SPORT_MASK_SP_TX_SLOT2_SEL                   ((u32)0x00000007 << 8)                              /*!<R/W 0x2  Select the data of slot 2. 0: CH0 Data 1: CH1 Data 2: CH2 Data 3: CH3 Data 4: CH4 Data 5: CH5 Data 6: CH6 Data 7: CH7 Data */
#define SPORT_SHIFT_SP_TX_SLOT1_SEL                  4
#define SPORT_MASK_SP_TX_SLOT1_SEL                   ((u32)0x00000007 << 4)                              /*!<R/W 0x1  Select the data of slot 1. 0: CH0 Data 1: CH1 Data 2: CH2 Data 3: CH3 Data 4: CH4 Data 5: CH5 Data 6: CH6 Data 7: CH7 Data */
#define SPORT_SHIFT_SP_TX_SLOT0_SEL                  0
#define SPORT_MASK_SP_TX_SLOT0_SEL                   ((u32)0x00000007 << 0)                              /*!<R/W 0  Select the data of slot 0. 0: CH0 Data 1: CH1 Data 2: CH2 Data 3: CH3 Data 4: CH4 Data 5: CH5 Data 6: CH6 Data 7: CH7 Data */
/** @} */

/**************************************************************************//**
 * @defgroup SPORT_SP_TX_FIFO_1
 * @brief  SPORT TX FIFO_1 Register                  (@ 0X040)
 * @{
 *****************************************************************************/
#define SPORT_SHIFT_SP_TX_FIFO_1                     0
#define SPORT_MASK_SP_TX_FIFO_1                      ((u32)0xFFFFFFFF << 0)                              /*!<W 0  TX FIFO_1 data register */
/** @} */

/**************************************************************************//**
 * @defgroup SPORT_SP_TX1_RX1_DAT_CON
 * @brief  SPORT TX1 and RX1 Data Control Register   (@ 0X044)
 * @{
 *****************************************************************************/
#define SPORT_SHIFT_SP_RX_LSB_FIRST_1                31
#define SPORT_BIT_SP_RX_LSB_FIRST_1                  ((u32)0x00000001 << 31)                             /*!<R/W 0  RX1 transmit 0: MSB first 1: LSB first */
#define SPORT_SHIFT_SP_TX_LSB_FIRST_1                30
#define SPORT_BIT_SP_TX_LSB_FIRST_1                  ((u32)0x00000001 << 30)                             /*!<R/W 0  TX1 transmit 0: MSB first 1: LSB first */
#define SPORT_SHIFT_SP_RX_SNK_LR_SWAP_1              29
#define SPORT_BIT_SP_RX_SNK_LR_SWAP_1                ((u32)0x00000001 << 29)                             /*!<R/W 0  0: Disable 1: Swap L/R audio samples written to the sink memory of RX_FIFO_1 */
#define SPORT_SHIFT_SP_RX_SNK_BYTE_SWAP_1            28
#define SPORT_BIT_SP_RX_SNK_BYTE_SWAP_1              ((u32)0x00000001 << 28)                             /*!<R/W 0  0: Disable 1: Swap H/L bytes written to the sink memory of RX_FIFO_1 */
#define SPORT_SHIFT_SP_TX_SRC_LR_SWAP_1              27
#define SPORT_BIT_SP_TX_SRC_LR_SWAP_1                ((u32)0x00000001 << 27)                             /*!<R/W 0  0: Disable 1: Swap L/R audio samples read from the source memory of TX_FIFO_1 */
#define SPORT_SHIFT_SP_TX_SRC_BYTE_SWAP_1            26
#define SPORT_BIT_SP_TX_SRC_BYTE_SWAP_1              ((u32)0x00000001 << 26)                             /*!<R/W 0  0: Disable 1: Swap H/L bytes read from the source memory of TX_FIFO_1  */
/** @} */

/**************************************************************************//**
 * @defgroup SPORT_SP_TX1_RX1_FORM_CON
 * @brief   SPORT TX1 and RX1 Format Control Register (@ 0X048)
 * @{
 *****************************************************************************/
#define SPORT_SHIFT_SP_EN_I2S_MONO_RX_1              31
#define SPORT_BIT_SP_EN_I2S_MONO_RX_1                ((u32)0x00000001 << 31)                             /*!<R/W 0  It is valid if SP_TRX_SAME_FS is 0. Data format of SD_I 0: stereo 1: mono */
#define SPORT_SHIFT_SP_DATA_LEN_SEL_RX_1             28
#define SPORT_MASK_SP_DATA_LEN_SEL_RX_1              ((u32)0x00000007 << 28)                             /*!<R/W 0  It is valid if SP_TRX_SAME_FS is 0. Data length of SD_I 000: 16 bits 001: 20 bits 010: 24 bits 100: 32 bits Others: Reserved */
#define SPORT_SHIFT_SP_EN_I2S_MONO_TX_1              27
#define SPORT_BIT_SP_EN_I2S_MONO_TX_1                ((u32)0x00000001 << 27)                             /*!<R/W 0  0: Stereo 1: Mono */
#define SPORT_SHIFT_SP_DATA_LEN_SEL_TX_1             24
#define SPORT_MASK_SP_DATA_LEN_SEL_TX_1              ((u32)0x00000007 << 24)                             /*!<R/W 0  000: 16 bits 001: 20 bits 010: 24 bits 100: 32 bits Others: Reserved */
/** @} */

/**************************************************************************//**
 * @defgroup SPORT_SP_RX_FIFO_1
 * @brief  SPORT RX FIFO_1 Register                  (@ 0X050)
 * @{
 *****************************************************************************/
#define SPORT_SHIFT_SP_RX_FIFO_1                     0
#define SPORT_MASK_SP_RX_FIFO_1                      ((u32)0xFFFFFFFF << 0)                              /*!<R 0  RX FIFO_1 data register */
/** @} */

/**************************************************************************//**
 * @defgroup SPORT_SP_RX_SLOT_SELE_0_3CH
 * @brief  SPORT RX Slot Selection 0-3 Channel Register (@ 0X054)
 * @{
 *****************************************************************************/
#define SPORT_SHIFT_SP_RX_CH3_SEL                    24
#define SPORT_MASK_SP_RX_CH3_SEL                     ((u32)0x00000007 << 24)                             /*!<R/W 0x3  Select the slot of CH3. 0: Slot 0 1: Slot 1 2: Slot 2 3: Slot 3 4: Slot 4 5: Slot 5 6: Slot 6 7: Slot 7 */
#define SPORT_SHIFT_SP_RX_CH2_SEL                    16
#define SPORT_MASK_SP_RX_CH2_SEL                     ((u32)0x00000007 << 16)                             /*!<R/W 0x2  Select the slot of CH2. 0: Slot 0 1: Slot 1 2: Slot 2 3: Slot 3 4: Slot 4 5: Slot 5 6: Slot 6 7: Slot 7 */
#define SPORT_SHIFT_SP_RX_CH1_SEL                    8
#define SPORT_MASK_SP_RX_CH1_SEL                     ((u32)0x00000007 << 8)                              /*!<R/W 0x1  Select the slot of CH1. 0: Slot 0 1: Slot 1 2: Slot 2 3: Slot 3 4: Slot 4 5: Slot 5 6: Slot 6 7: Slot 7 */
#define SPORT_SHIFT_SP_RX_CH0_SEL                    0
#define SPORT_MASK_SP_RX_CH0_SEL                     ((u32)0x00000007 << 0)                              /*!<R/W 0  Select the slot of CH0. 0: Slot 0 1: Slot 1 2: Slot 2 3: Slot 3 4: Slot 4 5: Slot 5 6: Slot 6 7: Slot 7 */
/** @} */

/**************************************************************************//**
 * @defgroup SPORT_SP_RX_SLOT_SELE_4_7CH
 * @brief  SPORT RX Slot Selection 4-7 Channel Register (@ 0X058)
 * @{
 *****************************************************************************/
#define SPORT_SHIFT_SP_RX_CH7_SEL                    24
#define SPORT_MASK_SP_RX_CH7_SEL                     ((u32)0x00000007 << 24)                             /*!<R/W 0x7  Select the slot of CH7. 0: Slot 0 1: Slot 1 2: Slot 2 3: Slot 3 4: Slot 4 5: Slot 5 6: Slot 6 7: Slot 7 */
#define SPORT_SHIFT_SP_RX_CH6_SEL                    16
#define SPORT_MASK_SP_RX_CH6_SEL                     ((u32)0x00000007 << 16)                             /*!<R/W 0x6  Select the slot of CH6. 0: Slot 0 1: Slot 1 2: Slot 2 3: Slot 3 4: Slot 4 5: Slot 5 6: Slot 6 7: Slot 7 */
#define SPORT_SHIFT_SP_RX_CH5_SEL                    8
#define SPORT_MASK_SP_RX_CH5_SEL                     ((u32)0x00000007 << 8)                              /*!<R/W 0x5  Select the slot of CH5. 0: Slot 0 1: Slot 1 2: Slot 2 3: Slot 3 4: Slot 4 5: Slot 5 6: Slot 6 7: Slot 7 */
#define SPORT_SHIFT_SP_RX_CH4_SEL                    0
#define SPORT_MASK_SP_RX_CH4_SEL                     ((u32)0x00000007 << 0)                              /*!<R/W 0x4  Select the slot of CH4. 0: Slot 0 1: Slot 1 2: Slot 2 3: Slot 3 4: Slot 4 5: Slot 5 6: Slot 6 7: Slot 7 */
/** @} */

/**************************************************************************//**
 * @defgroup SPORT_SP_ERR_CNT_CON
 * @brief  SPORT Error Count Control Register        (@ 0X05C)
 * @{
 *****************************************************************************/
#define SPORT_SHIFT_SP_RX_DEPTH_THR_1                24
#define SPORT_MASK_SP_RX_DEPTH_THR_1                 ((u32)0x0000003F << 24)                             /*!<R/W 0x1  Threshold of RX_FIFO_1. Set as the data consumption of RX_FIFO_1 in one LRCK. This value is the FIFO layer, and one layer is 32 bits. */
#define SPORT_SHIFT_SP_TX_DEPTH_THR_1                16
#define SPORT_MASK_SP_TX_DEPTH_THR_1                 ((u32)0x0000003F << 16)                             /*!<R/W 0x1  Threshold of TX_FIFO_1. Set as the data consumption of TX_FIFO_1 in one LRCK. This value is the FIFO layer, and one layer is 32 bits. */
#define SPORT_SHIFT_SP_RX_DEPTH_THR_0                8
#define SPORT_MASK_SP_RX_DEPTH_THR_0                 ((u32)0x0000003F << 8)                              /*!<R/W 0x1  Threshold of RX_FIFO_0. Set as the data consumption of RX_FIFO_0 in one LRCK. This value is the FIFO layer, and one layer is 32 bits. */
#define SPORT_SHIFT_SP_TX_DEPTH_THR_0                0
#define SPORT_MASK_SP_TX_DEPTH_THR_0                 ((u32)0x0000003F << 0)                              /*!<R/W 0x1  Threshold of TX_FIFO_0. Set as the data consumption of TX_FIFO_0 in one LRCK. This value is the FIFO layer, and one layer is 32 bits. */
/** @} */

