Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_sport_type.h
/**************************************************************************//**
 * @defgroup SPORT_SP_DMA_CON
 * @brief  SPORT DMA Control Register                (@ 0X060)
 * @{
 *****************************************************************************/
#define SPORT_SHIFT_SP_PAGE_SIZE                     16
#define SPORT_MASK_SP_PAGE_SIZE                      ((u32)0x00000FFF << 16)                             /*!<R/W 0  Memory page size = PAGE_SIZE + 1 (word unit) */
#define SPORT_SHIFT_SP_BURST_SIZE                    12
#define SPORT_MASK_SP_BURST_SIZE                     ((u32)0x00000003 << 12)                             /*!<R/W 0  Set DMA burst size. When SP_MCU_CTL_MODE is 0, SP_TX_FIFO_TH and SP_RX_FIFO_TH also must be set to 15, 7, or 3 according SP_BURST_SIZE. For example: When SP_BURST_SIZE is 0, SP_TX_FIFO_TH and SP_RX_FIFO_TH are 15. 00: Burst size is 16. Total burst data is 64 bytes. 01: Burst size is 8. Total burst data is 32 bytes. 10: Burst size is 4. Total burst data is 16 bytes. Others: Reserved */
#define SPORT_SHIFT_SP_PAGE_NUM                      8
#define SPORT_MASK_SP_PAGE_NUM                       ((u32)0x00000003 << 8)                              /*!<R/W 0x3  Page number: 00 : inactive 01 : the page number is 2 10 : the page number is 3 11 : the page number is 4 */
#define SPORT_SHIFT_SP_DMA_CTRL                      4
#define SPORT_BIT_SP_DMA_CTRL                        ((u32)0x00000001 << 4)                              /*!<R/W 0x1  DMA Burst-length calculation methods 0: Self-calculation based on Page Size and Page Pointer settings 1: Calculation based on FIFO status (default) */
#define SPORT_SHIFT_SP_RX_DMA_EN                     2
#define SPORT_BIT_SP_RX_DMA_EN                       ((u32)0x00000001 << 2)                              /*!<R/W 0  0: Disable RX DMA, close Interrupt, and keep the DMA pointer. 1: Enable RX DMA. */
#define SPORT_SHIFT_SP_TX_DMA_EN                     1
#define SPORT_BIT_SP_TX_DMA_EN                       ((u32)0x00000001 << 1)                              /*!<R/W 0  0: Disable TX DMA, close Interrupt, and keep the DMA pointer. 1: Enable TX DMA. */
#define SPORT_SHIFT_SP_DMA_RSTN                      0
#define SPORT_BIT_SP_DMA_RSTN                        ((u32)0x00000001 << 0)                              /*!<R/W 0  Reset the DMA mechanism like state machine, the DMA pointer. 0: Make I2S execute the reset 1: Make I2S stop the reset */
/** @} */

/**************************************************************************//**
 * @defgroup SPORT_SP_TX0_DMA_PP
 * @brief  SPORT TX0 DMA Page Pointer Register       (@ 0X064)
 * @{
 *****************************************************************************/
#define SPORT_SHIFT_SP_TX0_PAGE_PTR                  2
#define SPORT_MASK_SP_TX0_PAGE_PTR                   ((u32)0x3FFFFFFF << 2)                              /*!<R/W 0  TX0 Page pointer. This is a physical address with word-align limitation. */
/** @} */

/**************************************************************************//**
 * @defgroup SPORT_SP_TX0_DMA_INT_EN
 * @brief  SPORT TX0 DMA Interrupt Enable Register   (@ 0X068)
 * @{
 *****************************************************************************/
#define SPORT_SHIFT_SP_TX0_UNDERFLOW_IE              24
#define SPORT_BIT_SP_TX0_UNDERFLOW_IE                ((u32)0x00000001 << 24)                             /*!<R/W 0  TX0 FIFO Underflow Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
#define SPORT_SHIFT_SP_TX0_PAGE3ERRIE                19
#define SPORT_BIT_SP_TX0_PAGE3ERRIE                  ((u32)0x00000001 << 19)                             /*!<R/W 0  TX0 PAGE 3 unavailable Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
#define SPORT_SHIFT_SP_TX0_PAGE2ERRIE                18
#define SPORT_BIT_SP_TX0_PAGE2ERRIE                  ((u32)0x00000001 << 18)                             /*!<R/W 0  TX0 PAGE 2 unavailable Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
#define SPORT_SHIFT_SP_TX0_PAGE1ERRIE                17
#define SPORT_BIT_SP_TX0_PAGE1ERRIE                  ((u32)0x00000001 << 17)                             /*!<R/W 0  TX0 PAGE 1 unavailable Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
#define SPORT_SHIFT_SP_TX0_PAGE0ERRIE                16
#define SPORT_BIT_SP_TX0_PAGE0ERRIE                  ((u32)0x00000001 << 16)                             /*!<R/W 0  TX0 PAGE 0 error Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
#define SPORT_SHIFT_SP_TX0_PAGE3UNAVA_IE             11
#define SPORT_BIT_SP_TX0_PAGE3UNAVA_IE               ((u32)0x00000001 << 11)                             /*!<R/W 0  TX0 PAGE 3 unavailable Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
#define SPORT_SHIFT_SP_TX0_PAGE2UNAVA_IE             10
#define SPORT_BIT_SP_TX0_PAGE2UNAVA_IE               ((u32)0x00000001 << 10)                             /*!<R/W 0  TX0PAGE 2 unavailable Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
#define SPORT_SHIFT_SP_TX0_PAGE1UNAVA_IE             9
#define SPORT_BIT_SP_TX0_PAGE1UNAVA_IE               ((u32)0x00000001 << 9)                              /*!<R/W 0  TX0 PAGE 1 unavailable Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
#define SPORT_SHIFT_SP_TX0_PAGE0UNAVA_IE             8
#define SPORT_BIT_SP_TX0_PAGE0UNAVA_IE               ((u32)0x00000001 << 8)                              /*!<R/W 0  TX0 PAGE 0 unavailable Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
#define SPORT_SHIFT_SP_TX0_P3OKIE                    3
#define SPORT_BIT_SP_TX0_P3OKIE                      ((u32)0x00000001 << 3)                              /*!<R/W 0  TX0 Page 3 OK Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
#define SPORT_SHIFT_SP_TX0_P2OKIE                    2
#define SPORT_BIT_SP_TX0_P2OKIE                      ((u32)0x00000001 << 2)                              /*!<R/W 0  TX0 Page 2 OK Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
#define SPORT_SHIFT_SP_TX0_P1OKIE                    1
#define SPORT_BIT_SP_TX0_P1OKIE                      ((u32)0x00000001 << 1)                              /*!<R/W 0  TX0 Page 1 OK Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
#define SPORT_SHIFT_SP_TX0_P0OKIE                    0
#define SPORT_BIT_SP_TX0_P0OKIE                      ((u32)0x00000001 << 0)                              /*!<R/W 0  TX0 Page 0 OK Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
/** @} */

/**************************************************************************//**
 * @defgroup SPORT_SP_TX0_DMA_INT_STA
 * @brief  SPORT TX0 DMA Interrupt Status Register   (@ 0X06C)
 * @{
 *****************************************************************************/
#define SPORT_SHIFT_SP_TX0_UNDERFLOW_IP              24
#define SPORT_BIT_SP_TX0_UNDERFLOW_IP                ((u32)0x00000001 << 24)                             /*!<W 0  TX0 FIFO Underflow Interrupt Pending 0: No Interrupt 1: Interrupt pending, write 1 to clear */
#define SPORT_SHIFT_SP_TX0_PAGE3ERRIP                19
#define SPORT_BIT_SP_TX0_PAGE3ERRIP                  ((u32)0x00000001 << 19)                             /*!<W 0  TX0 PAGE 3 Error Interrupt Pending. Fabric bus responses DEC/SLV error. 0: No error interrupt 1: Interrupt pending */
#define SPORT_SHIFT_SP_TX0_PAGE2ERRIP                18
#define SPORT_BIT_SP_TX0_PAGE2ERRIP                  ((u32)0x00000001 << 18)                             /*!<W 0  TX0 PAGE 2 Error Interrupt Pending. Fabric bus responses DEC/SLV error. 0: No error interrupt 1: Interrupt pending */
#define SPORT_SHIFT_SP_TX0_PAGE1ERRIP                17
#define SPORT_BIT_SP_TX0_PAGE1ERRIP                  ((u32)0x00000001 << 17)                             /*!<W 0  TX0 PAGE 1 Error Interrupt Pending. Fabric bus responses DEC/SLV error. 0: No error interrupt 1: Interrupt pending */
#define SPORT_SHIFT_SP_TX0_PAGE0ERRIP                16
#define SPORT_BIT_SP_TX0_PAGE0ERRIP                  ((u32)0x00000001 << 16)                             /*!<W 0  TX0 PAGE 0 Error Interrupt Pending. Fabric bus responses DEC/SLV error. 0: No error interrupt 1: Interrupt pending */
#define SPORT_SHIFT_SP_TX0_PAGE3UNAVA_IP             11
#define SPORT_BIT_SP_TX0_PAGE3UNAVA_IP               ((u32)0x00000001 << 11)                             /*!<W 0  TX0 PAGE 3 unavailable Interrupt Pending. The controller wants to execute the page but this page own bit does not be set. This situation will make the interrupt. 0: No Interrupt 1: Interrupt pending, write 1 to clear */
#define SPORT_SHIFT_SP_TX0_PAGE2UNAVA_IP             10
#define SPORT_BIT_SP_TX0_PAGE2UNAVA_IP               ((u32)0x00000001 << 10)                             /*!<W 0  TX0 PAGE 2 unavailable Interrupt Pending. The controller wants to execute the page but this page own bit does not be set. This situation will make the interrupt. 0: No Interrupt 1: Interrupt pending, write 1 to clear */
#define SPORT_SHIFT_SP_TX0_PAGE1UNAVA_IP             9
#define SPORT_BIT_SP_TX0_PAGE1UNAVA_IP               ((u32)0x00000001 << 9)                              /*!<W 0  TX0 PAGE 1 unavailable Interrupt Pending. The controller wants to execute the page but this page own bit does not be set. This situation will make the interrupt. 0: No Interrupt 1: Interrupt pending, write 1 to clear */
#define SPORT_SHIFT_SP_TX0_PAGE0UNAVA_IP             8
#define SPORT_BIT_SP_TX0_PAGE0UNAVA_IP               ((u32)0x00000001 << 8)                              /*!<W 0  TX0 PAGE 0 unavailable Interrupt Pending. The controller wants to execute the page but this page own bit does not be set. This situation will make the interrupt. 0: No Interrupt 1: Interrupt pending, write 1 to clear */
#define SPORT_SHIFT_SP_TX0_P3OKIP                    3
#define SPORT_BIT_SP_TX0_P3OKIP                      ((u32)0x00000001 << 3)                              /*!<W 0  TX0 Page 3 OK Interrupt Pending 0: No Interrupt 1: Interrupt pending, write 1 to clear */
#define SPORT_SHIFT_SP_TX0_P2OKIP                    2
#define SPORT_BIT_SP_TX0_P2OKIP                      ((u32)0x00000001 << 2)                              /*!<W 0  TX0 Page 2 OK Interrupt Pending 0: No Interrupt 1: Interrupt pending, write 1 to clear */
#define SPORT_SHIFT_SP_TX0_P1OKIP                    1
#define SPORT_BIT_SP_TX0_P1OKIP                      ((u32)0x00000001 << 1)                              /*!<W 0  TX0 Page 1 OK Interrupt Pending 0: No Interrupt 1: Interrupt pending, write 1 to clear */
#define SPORT_SHIFT_SP_TX0_P0OKIP                    0
#define SPORT_BIT_SP_TX0_P0OKIP                      ((u32)0x00000001 << 0)                              /*!<W 0  TX0 Page 0 OK Interrupt Pending 0: No Interrupt 1: Interrupt pending, write 1 to clear */
/** @} */

/**************************************************************************//**
 * @defgroup SPORT_SP_TX1_DMA_PP
 * @brief  SPORT TX1 DMA Page Pointer Register       (@ 0X070)
 * @{
 *****************************************************************************/
#define SPORT_SHIFT_SP_TX1_PAGE_PTR                  2
#define SPORT_MASK_SP_TX1_PAGE_PTR                   ((u32)0x3FFFFFFF << 2)                              /*!<R/W 0  TX1 Page pointer. This is a physical address with word-align limitation. */
/** @} */

/**************************************************************************//**
 * @defgroup SPORT_SP_TX1_DMA_INT_EN
 * @brief  SPORT TX1 DMA Interrupt Enable Register   (@ 0X074)
 * @{
 *****************************************************************************/
#define SPORT_SHIFT_SP_TX1_UNDERFLOW_IE              24
#define SPORT_BIT_SP_TX1_UNDERFLOW_IE                ((u32)0x00000001 << 24)                             /*!<R/W 0  TX1 FIFO Underflow Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
#define SPORT_SHIFT_SP_TX1_PAGE3ERRIE                19
#define SPORT_BIT_SP_TX1_PAGE3ERRIE                  ((u32)0x00000001 << 19)                             /*!<R/W 0  TX1 PAGE 3 unavailable Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
#define SPORT_SHIFT_SP_TX1_PAGE2ERRIE                18
#define SPORT_BIT_SP_TX1_PAGE2ERRIE                  ((u32)0x00000001 << 18)                             /*!<R/W 0  TX1 PAGE 2 unavailable Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
#define SPORT_SHIFT_SP_TX1_PAGE1ERRIE                17
#define SPORT_BIT_SP_TX1_PAGE1ERRIE                  ((u32)0x00000001 << 17)                             /*!<R/W 0  TX1 PAGE 1 unavailable Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
#define SPORT_SHIFT_SP_TX1_PAGE0ERRIE                16
#define SPORT_BIT_SP_TX1_PAGE0ERRIE                  ((u32)0x00000001 << 16)                             /*!<R/W 0  TX1 PAGE 0 error Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
#define SPORT_SHIFT_SP_TX1_PAGE3UNAVA_IE             11
#define SPORT_BIT_SP_TX1_PAGE3UNAVA_IE               ((u32)0x00000001 << 11)                             /*!<R/W 0  TX1 PAGE 3 unavailable Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
#define SPORT_SHIFT_SP_TX1_PAGE2UNAVA_IE             10
#define SPORT_BIT_SP_TX1_PAGE2UNAVA_IE               ((u32)0x00000001 << 10)                             /*!<R/W 0  TX1 PAGE 2 unavailable Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
#define SPORT_SHIFT_SP_TX1_PAGE1UNAVA_IE             9
#define SPORT_BIT_SP_TX1_PAGE1UNAVA_IE               ((u32)0x00000001 << 9)                              /*!<R/W 0  TX1 PAGE 1 unavailable Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
#define SPORT_SHIFT_SP_TX1_PAGE0UNAVA_IE             8
#define SPORT_BIT_SP_TX1_PAGE0UNAVA_IE               ((u32)0x00000001 << 8)                              /*!<R/W 0  TX1 PAGE 0 unavailable Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
#define SPORT_SHIFT_SP_TX1_P3OKIE                    3
#define SPORT_BIT_SP_TX1_P3OKIE                      ((u32)0x00000001 << 3)                              /*!<R/W 0  TX1 Page 3 OK Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
#define SPORT_SHIFT_SP_TX1_P2OKIE                    2
#define SPORT_BIT_SP_TX1_P2OKIE                      ((u32)0x00000001 << 2)                              /*!<R/W 0  TX1 Page 2 OK Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
#define SPORT_SHIFT_SP_TX1_P1OKIE                    1
#define SPORT_BIT_SP_TX1_P1OKIE                      ((u32)0x00000001 << 1)                              /*!<R/W 0  TX1 Page 1 OK Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
#define SPORT_SHIFT_SP_TX1_P0OKIE                    0
#define SPORT_BIT_SP_TX1_P0OKIE                      ((u32)0x00000001 << 0)                              /*!<R/W 0  TX1 Page 0 OK Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
/** @} */

/**************************************************************************//**
 * @defgroup SPORT_SP_TX1_DMA_INT_STA
 * @brief  SPORT TX1 DMA Interrupt Status Register   (@ 0X078)
 * @{
 *****************************************************************************/
#define SPORT_SHIFT_SP_TX1_UNDERFLOW_IP              24
#define SPORT_BIT_SP_TX1_UNDERFLOW_IP                ((u32)0x00000001 << 24)                             /*!<W 0  TX1 FIFO Underflow Interrupt Pending 0: No Interrupt 1: Interrupt pending, write 1 to clear */
#define SPORT_SHIFT_SP_TX1_PAGE3ERRIP                19
#define SPORT_BIT_SP_TX1_PAGE3ERRIP                  ((u32)0x00000001 << 19)                             /*!<W 0  TX1 PAGE 3 Error Interrupt Pending. Fabric bus responses DEC/SLV error. 0: No error interrupt 1: Interrupt pending */
#define SPORT_SHIFT_SP_TX1_PAGE2ERRIP                18
#define SPORT_BIT_SP_TX1_PAGE2ERRIP                  ((u32)0x00000001 << 18)                             /*!<W 0  TX1 PAGE 2 Error Interrupt Pending. Fabric bus responses DEC/SLV error. 0: No error interrupt 1: Interrupt pending */
#define SPORT_SHIFT_SP_TX1_PAGE1ERRIP                17
#define SPORT_BIT_SP_TX1_PAGE1ERRIP                  ((u32)0x00000001 << 17)                             /*!<W 0  TX1 PAGE 1 Error Interrupt Pending. Fabric bus responses DEC/SLV error. 0: No error interrupt 1: Interrupt pending */
#define SPORT_SHIFT_SP_TX1_PAGE0ERRIP                16
#define SPORT_BIT_SP_TX1_PAGE0ERRIP                  ((u32)0x00000001 << 16)                             /*!<W 0  TX1 PAGE 0 Error Interrupt Pending. Fabric bus responses DEC/SLV error. 0: No error interrupt 1: Interrupt pending */
#define SPORT_SHIFT_SP_TX1_PAGE3UNAVA_IP             11
#define SPORT_BIT_SP_TX1_PAGE3UNAVA_IP               ((u32)0x00000001 << 11)                             /*!<W 0  TX1 PAGE 3 unavailable Interrupt Pending. The controller wants to execute the page but this page own bit does not be set. This situation will make the interrupt. 0: No Interrupt 1: Interrupt pending, write 1 to clear */
#define SPORT_SHIFT_SP_TX1_PAGE2UNAVA_IP             10
#define SPORT_BIT_SP_TX1_PAGE2UNAVA_IP               ((u32)0x00000001 << 10)                             /*!<W 0  TX1 PAGE 2 unavailable Interrupt Pending. The controller wants to execute the page but this page own bit does not be set. This situation will make the interrupt. 0: No Interrupt 1: Interrupt pending, write 1 to clear */
#define SPORT_SHIFT_SP_TX1_PAGE1UNAVA_IP             9
#define SPORT_BIT_SP_TX1_PAGE1UNAVA_IP               ((u32)0x00000001 << 9)                              /*!<W 0  TX1 PAGE 1 unavailable Interrupt Pending. The controller wants to execute the page but this page own bit does not be set. This situation will make the interrupt. 0: No Interrupt 1: Interrupt pending, write 1 to clear */
#define SPORT_SHIFT_SP_TX1_PAGE0UNAVA_IP             8
#define SPORT_BIT_SP_TX1_PAGE0UNAVA_IP               ((u32)0x00000001 << 8)                              /*!<W 0  TX1 PAGE 0 unavailable Interrupt Pending. The controller wants to execute the page but this page own bit does not be set. This situation will make the interrupt. 0: No Interrupt 1: Interrupt pending, write 1 to clear */
#define SPORT_SHIFT_SP_TX1_P3OKIP                    3
#define SPORT_BIT_SP_TX1_P3OKIP                      ((u32)0x00000001 << 3)                              /*!<W 0  TX1 Page 3 OK Interrupt Pending 0: No Interrupt 1: Interrupt pending, write 1 to clear */
#define SPORT_SHIFT_SP_TX1_P2OKIP                    2
#define SPORT_BIT_SP_TX1_P2OKIP                      ((u32)0x00000001 << 2)                              /*!<W 0  TX1 Page 2 OK Interrupt Pending 0: No Interrupt 1: Interrupt pending, write 1 to clear */
#define SPORT_SHIFT_SP_TX1_P1OKIP                    1
#define SPORT_BIT_SP_TX1_P1OKIP                      ((u32)0x00000001 << 1)                              /*!<W 0  TX1 Page 1 OK Interrupt Pending 0: No Interrupt 1: Interrupt pending, write 1 to clear */
#define SPORT_SHIFT_SP_TX1_P0OKIP                    0
#define SPORT_BIT_SP_TX1_P0OKIP                      ((u32)0x00000001 << 0)                              /*!<W 0  TX1 Page 0 OK Interrupt Pending 0: No Interrupt 1: Interrupt pending, write 1 to clear */
/** @} */

/**************************************************************************//**
 * @defgroup SPORT_SP_TX_PAGE_OWN
 * @brief  SPORT TX Page Own Register                (@ 0X07C)
 * @{
 *****************************************************************************/
#define SPORT_SHIFT_SP_TX1_P3OWN                     7
#define SPORT_BIT_SP_TX1_P3OWN                       ((u32)0x00000001 << 7)                              /*!<R/W 0  TX1 Page 3 Own bit 0: Page 0 owned by CPU 1: Page 0 owned by controller DMA sets this bit to 0 when TX channel 0 Page 0 is done */
#define SPORT_SHIFT_SP_TX1_P2OWN                     6
#define SPORT_BIT_SP_TX1_P2OWN                       ((u32)0x00000001 << 6)                              /*!<R/W 0  TX1 Page 2 Own bit 0: Page 0 owned by CPU 1: Page 0 owned by controller DMA sets this bit to 0 when TX channel 0 Page 0 is done */
#define SPORT_SHIFT_SP_TX1_P1OWN                     5
#define SPORT_BIT_SP_TX1_P1OWN                       ((u32)0x00000001 << 5)                              /*!<R/W 0  TX1 Page 1 Own bit 0: Page 0 owned by CPU 1: Page 0 owned by controller DMA sets this bit to 0 when TX channel 0 Page 0 is done */
#define SPORT_SHIFT_SP_TX1_P0OWN                     4
#define SPORT_BIT_SP_TX1_P0OWN                       ((u32)0x00000001 << 4)                              /*!<R/W 0  TX1 Page 0 Own bit 0: Page 0 owned by CPU 1: Page 0 owned by controller DMA sets this bit to 0 when TX channel 0 Page 0 is done */
#define SPORT_SHIFT_SP_TX0_P3OWN                     3
#define SPORT_BIT_SP_TX0_P3OWN                       ((u32)0x00000001 << 3)                              /*!<R/W 0  TX0 Page 3 Own bit 0: Page 0 owned by CPU 1: Page 0 owned by controller DMA sets this bit to 0 when TX channel 0 Page 0 is done */
#define SPORT_SHIFT_SP_TX0_P2OWN                     2
#define SPORT_BIT_SP_TX0_P2OWN                       ((u32)0x00000001 << 2)                              /*!<R/W 0  TX0 Page 2 Own bit 0: Page 0 owned by CPU 1: Page 0 owned by controller DMA sets this bit to 0 when TX channel 0 Page 0 is done */
#define SPORT_SHIFT_SP_TX0_P1OWN                     1
#define SPORT_BIT_SP_TX0_P1OWN                       ((u32)0x00000001 << 1)                              /*!<R/W 0  TX0 Page 1 Own bit 0: Page 0 owned by CPU 1: Page 0 owned by controller DMA sets this bit to 0 when TX channel 0 Page 0 is done */
#define SPORT_SHIFT_SP_TX0_P0OWN                     0
#define SPORT_BIT_SP_TX0_P0OWN                       ((u32)0x00000001 << 0)                              /*!<R/W 0  TX0 Page 0 Own bit 0: Page 0 owned by CPU 1: Page 0 owned by controller DMA sets this bit to 0 when TX channel 0 Page 0 is done */
/** @} */

/**************************************************************************//**
 * @defgroup SPORT_SP_RX0_DMA_PP
 * @brief  SPORT RX0 DMA Page Pointer Register       (@ 0X080)
 * @{
 *****************************************************************************/
#define SPORT_SHIFT_SP_RX0_PAGE_PTR                  2
#define SPORT_MASK_SP_RX0_PAGE_PTR                   ((u32)0x3FFFFFFF << 2)                              /*!<R/W 0  RX0 Page pointer. This is a physical address with word-align limitation. */
/** @} */

