Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_sport_type.h
/**************************************************************************//**
 * @defgroup SPORT_SP_RX0_DMA_INT_EN
 * @brief  SPORT RX0 DMA Interrupt Enable Register   (@ 0X084)
 * @{
 *****************************************************************************/
#define SPORT_SHIFT_SP_RX0_OVERFLOW_IE               24
#define SPORT_BIT_SP_RX0_OVERFLOW_IE                 ((u32)0x00000001 << 24)                             /*!<R/W 0  RX0 FIFO overflow Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
#define SPORT_SHIFT_SP_RX0_PAGE3ERRIE                19
#define SPORT_BIT_SP_RX0_PAGE3ERRIE                  ((u32)0x00000001 << 19)                             /*!<R/W 0  RX0 PAGE 3 unavailable Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
#define SPORT_SHIFT_SP_RX0_PAGE2ERRIE                18
#define SPORT_BIT_SP_RX0_PAGE2ERRIE                  ((u32)0x00000001 << 18)                             /*!<R/W 0  RX0 PAGE 2 unavailable Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
#define SPORT_SHIFT_SP_RX0_PAGE1ERRIE                17
#define SPORT_BIT_SP_RX0_PAGE1ERRIE                  ((u32)0x00000001 << 17)                             /*!<R/W 0  RX0 PAGE 1 unavailable Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
#define SPORT_SHIFT_SP_RX0_PAGE0ERRIE                16
#define SPORT_BIT_SP_RX0_PAGE0ERRIE                  ((u32)0x00000001 << 16)                             /*!<R/W 0  RX0 PAGE 0 error Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
#define SPORT_SHIFT_SP_RX0_PAGE3UNAVA_IE             11
#define SPORT_BIT_SP_RX0_PAGE3UNAVA_IE               ((u32)0x00000001 << 11)                             /*!<R/W 0  RX0 PAGE 3 unavailable Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
#define SPORT_SHIFT_SP_RX0_PAGE2UNAVA_IE             10
#define SPORT_BIT_SP_RX0_PAGE2UNAVA_IE               ((u32)0x00000001 << 10)                             /*!<R/W 0  RX0PAGE 2 unavailable Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
#define SPORT_SHIFT_SP_RX0_PAGE1UNAVA_IE             9
#define SPORT_BIT_SP_RX0_PAGE1UNAVA_IE               ((u32)0x00000001 << 9)                              /*!<R/W 0  RX0 PAGE 1 unavailable Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
#define SPORT_SHIFT_SP_RX0_PAGE0UNAVA_IE             8
#define SPORT_BIT_SP_RX0_PAGE0UNAVA_IE               ((u32)0x00000001 << 8)                              /*!<R/W 0  RX0 PAGE 0 unavailable Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
#define SPORT_SHIFT_SP_RX0_P3OKIE                    3
#define SPORT_BIT_SP_RX0_P3OKIE                      ((u32)0x00000001 << 3)                              /*!<R/W 0  RX0 Page 3 OK Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
#define SPORT_SHIFT_SP_RX0_P2OKIE                    2
#define SPORT_BIT_SP_RX0_P2OKIE                      ((u32)0x00000001 << 2)                              /*!<R/W 0  RX0 Page 2 OK Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
#define SPORT_SHIFT_SP_RX0_P1OKIE                    1
#define SPORT_BIT_SP_RX0_P1OKIE                      ((u32)0x00000001 << 1)                              /*!<R/W 0  RX0 Page 1 OK Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
#define SPORT_SHIFT_SP_RX0_P0OKIE                    0
#define SPORT_BIT_SP_RX0_P0OKIE                      ((u32)0x00000001 << 0)                              /*!<R/W 0  RX0 Page 0 OK Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
/** @} */

/**************************************************************************//**
 * @defgroup SPORT_SP_RX0_DMA_INT_STA
 * @brief  SPORT RX0 DMA Interrupt Status Register   (@ 0X088)
 * @{
 *****************************************************************************/
#define SPORT_SHIFT_SP_RX0_OVERFLOW_IP               24
#define SPORT_BIT_SP_RX0_OVERFLOW_IP                 ((u32)0x00000001 << 24)                             /*!<W 0  RX0 FIFO overflow Interrupt Pending 0: No Interrupt 1: Interrupt pending, write 1 to clear */
#define SPORT_SHIFT_SP_RX0_PAGE3ERRIP                19
#define SPORT_BIT_SP_RX0_PAGE3ERRIP                  ((u32)0x00000001 << 19)                             /*!<W 0  RX0 PAGE 3 Error Interrupt Pending. Fabric bus responses DEC/SLV error. 0: No error interrupt 1: Interrupt pending */
#define SPORT_SHIFT_SP_RX0_PAGE2ERRIP                18
#define SPORT_BIT_SP_RX0_PAGE2ERRIP                  ((u32)0x00000001 << 18)                             /*!<W 0  RX0 PAGE 2 Error Interrupt Pending. Fabric bus responses DEC/SLV error. 0: No error interrupt 1: Interrupt pending */
#define SPORT_SHIFT_SP_RX0_PAGE1ERRIP                17
#define SPORT_BIT_SP_RX0_PAGE1ERRIP                  ((u32)0x00000001 << 17)                             /*!<W 0  RX0 PAGE 1 Error Interrupt Pending. Fabric bus responses DEC/SLV error. 0: No error interrupt 1: Interrupt pending */
#define SPORT_SHIFT_SP_RX0_PAGE0ERRIP                16
#define SPORT_BIT_SP_RX0_PAGE0ERRIP                  ((u32)0x00000001 << 16)                             /*!<W 0  RX0 PAGE 0 Error Interrupt Pending. Fabric bus responses DEC/SLV error. 0: No error interrupt 1: Interrupt pending */
#define SPORT_SHIFT_SP_RX0_PAGE3UNAVA_IP             11
#define SPORT_BIT_SP_RX0_PAGE3UNAVA_IP               ((u32)0x00000001 << 11)                             /*!<W 0  RX0 PAGE 3 unavailable Interrupt Pending. The controller wants to execute the page but this page own bit does not be set. This situation will make the interrupt. 0: No Interrupt 1: Interrupt pending, write 1 to clear */
#define SPORT_SHIFT_SP_RX0_PAGE2UNAVA_IP             10
#define SPORT_BIT_SP_RX0_PAGE2UNAVA_IP               ((u32)0x00000001 << 10)                             /*!<W 0  RX0 PAGE 2 unavailable Interrupt Pending. The controller wants to execute the page but this page own bit does not be set. This situation will make the interrupt. 0: No Interrupt 1: Interrupt pending, write 1 to clear */
#define SPORT_SHIFT_SP_RX0_PAGE1UNAVA_IP             9
#define SPORT_BIT_SP_RX0_PAGE1UNAVA_IP               ((u32)0x00000001 << 9)                              /*!<W 0  RX0 PAGE 1 unavailable Interrupt Pending. The controller wants to execute the page but this page own bit does not be set. This situation will make the interrupt. 0: No Interrupt 1: Interrupt pending, write 1 to clear */
#define SPORT_SHIFT_SP_RX0_PAGE0UNAVA_IP             8
#define SPORT_BIT_SP_RX0_PAGE0UNAVA_IP               ((u32)0x00000001 << 8)                              /*!<W 0  RX0 PAGE 0 unavailable Interrupt Pending. The controller wants to execute the page but this page own bit does not be set. This situation will make the interrupt. 0: No Interrupt 1: Interrupt pending, write 1 to clear */
#define SPORT_SHIFT_SP_RX0_P3OKIP                    3
#define SPORT_BIT_SP_RX0_P3OKIP                      ((u32)0x00000001 << 3)                              /*!<W 0  RX0 Page 3 OK Interrupt Pending 0: No Interrupt 1: Interrupt pending, write 1 to clear */
#define SPORT_SHIFT_SP_RX0_P2OKIP                    2
#define SPORT_BIT_SP_RX0_P2OKIP                      ((u32)0x00000001 << 2)                              /*!<W 0  RX0 Page 2 OK Interrupt Pending 0: No Interrupt 1: Interrupt pending, write 1 to clear */
#define SPORT_SHIFT_SP_RX0_P1OKIP                    1
#define SPORT_BIT_SP_RX0_P1OKIP                      ((u32)0x00000001 << 1)                              /*!<W 0  RX0 Page 1 OK Interrupt Pending 0: No Interrupt 1: Interrupt pending, write 1 to clear */
#define SPORT_SHIFT_SP_RX0_P0OKIP                    0
#define SPORT_BIT_SP_RX0_P0OKIP                      ((u32)0x00000001 << 0)                              /*!<W 0  RX0 Page 0 OK Interrupt Pending 0: No Interrupt 1: Interrupt pending, write 1 to clear */
/** @} */

/**************************************************************************//**
 * @defgroup SPORT_SP_RX1_DMA_PP
 * @brief  SPORT RX1 DMA Page Pointer Register       (@ 0X08C)
 * @{
 *****************************************************************************/
#define SPORT_SHIFT_SP_RX1_PAGE_PTR                  2
#define SPORT_MASK_SP_RX1_PAGE_PTR                   ((u32)0x3FFFFFFF << 2)                              /*!<R/W 0  RX1 Page pointer. This is a physical address with word-align limitation. */
/** @} */

/**************************************************************************//**
 * @defgroup SPORT_SP_RX1_DMA_INT_EN
 * @brief  SPORT RX1 DMA Interrupt Enable Register   (@ 0X090)
 * @{
 *****************************************************************************/
#define SPORT_SHIFT_SP_RX1_UNDERFLOW_IE              24
#define SPORT_BIT_SP_RX1_UNDERFLOW_IE                ((u32)0x00000001 << 24)                             /*!<R/W 0  RX1 FIFO overflow Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
#define SPORT_SHIFT_SP_RX1_PAGE3ERRIE                19
#define SPORT_BIT_SP_RX1_PAGE3ERRIE                  ((u32)0x00000001 << 19)                             /*!<R/W 0  RX1 PAGE 3 unavailable Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
#define SPORT_SHIFT_SP_RX1_PAGE2ERRIE                18
#define SPORT_BIT_SP_RX1_PAGE2ERRIE                  ((u32)0x00000001 << 18)                             /*!<R/W 0  RX1 PAGE 2 unavailable Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
#define SPORT_SHIFT_SP_RX1_PAGE1ERRIE                17
#define SPORT_BIT_SP_RX1_PAGE1ERRIE                  ((u32)0x00000001 << 17)                             /*!<R/W 0  RX1 PAGE 1 unavailable Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
#define SPORT_SHIFT_SP_RX1_PAGE0ERRIE                16
#define SPORT_BIT_SP_RX1_PAGE0ERRIE                  ((u32)0x00000001 << 16)                             /*!<R/W 0  RX1 PAGE 0 error Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
#define SPORT_SHIFT_SP_RX1_PAGE3UNAVA_IE             11
#define SPORT_BIT_SP_RX1_PAGE3UNAVA_IE               ((u32)0x00000001 << 11)                             /*!<R/W 0  RX1 PAGE 3 unavailable Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
#define SPORT_SHIFT_SP_RX1_PAGE2UNAVA_IE             10
#define SPORT_BIT_SP_RX1_PAGE2UNAVA_IE               ((u32)0x00000001 << 10)                             /*!<R/W 0  RX1 PAGE 2 unavailable Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
#define SPORT_SHIFT_SP_RX1_PAGE1UNAVA_IE             9
#define SPORT_BIT_SP_RX1_PAGE1UNAVA_IE               ((u32)0x00000001 << 9)                              /*!<R/W 0  RX1 PAGE 1 unavailable Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
#define SPORT_SHIFT_SP_RX1_PAGE0UNAVA_IE             8
#define SPORT_BIT_SP_RX1_PAGE0UNAVA_IE               ((u32)0x00000001 << 8)                              /*!<R/W 0  RX1 PAGE 0 unavailable Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
#define SPORT_SHIFT_SP_RX1_P3OKIE                    3
#define SPORT_BIT_SP_RX1_P3OKIE                      ((u32)0x00000001 << 3)                              /*!<R/W 0  RX1 Page 3 OK Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
#define SPORT_SHIFT_SP_RX1_P2OKIE                    2
#define SPORT_BIT_SP_RX1_P2OKIE                      ((u32)0x00000001 << 2)                              /*!<R/W 0  RX1 Page 2 OK Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
#define SPORT_SHIFT_SP_RX1_P1OKIE                    1
#define SPORT_BIT_SP_RX1_P1OKIE                      ((u32)0x00000001 << 1)                              /*!<R/W 0  RX1 Page 1 OK Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
#define SPORT_SHIFT_SP_RX1_P0OKIE                    0
#define SPORT_BIT_SP_RX1_P0OKIE                      ((u32)0x00000001 << 0)                              /*!<R/W 0  RX1 Page 0 OK Interrupt Enable 0: Disable Interrupt 1: Enable Interrupt */
/** @} */

/**************************************************************************//**
 * @defgroup SPORT_SP_RX1_DMA_INT_STA
 * @brief  SPORT RX1 DMA Interrupt Status Register   (@ 0X094)
 * @{
 *****************************************************************************/
#define SPORT_SHIFT_SP_RX1_OVERFLOW_IP               24
#define SPORT_BIT_SP_RX1_OVERFLOW_IP                 ((u32)0x00000001 << 24)                             /*!<W 0  RX1 FIFO overflow Interrupt Pending 0: No Interrupt 1: Interrupt pending, write 1 to clear */
#define SPORT_SHIFT_SP_RX1_PAGE3ERRIP                19
#define SPORT_BIT_SP_RX1_PAGE3ERRIP                  ((u32)0x00000001 << 19)                             /*!<W 0  RX1 PAGE 3 Error Interrupt Pending. Fabric bus responses DEC/SLV error. 0: No error interrupt 1: Interrupt pending */
#define SPORT_SHIFT_SP_RX1_PAGE2ERRIP                18
#define SPORT_BIT_SP_RX1_PAGE2ERRIP                  ((u32)0x00000001 << 18)                             /*!<W 0  RX1 PAGE 2 Error Interrupt Pending. Fabric bus responses DEC/SLV error. 0: No error interrupt 1: Interrupt pending */
#define SPORT_SHIFT_SP_RX1_PAGE1ERRIP                17
#define SPORT_BIT_SP_RX1_PAGE1ERRIP                  ((u32)0x00000001 << 17)                             /*!<W 0  RX1 PAGE 1 Error Interrupt Pending. Fabric bus responses DEC/SLV error. 0: No error interrupt 1: Interrupt pending */
#define SPORT_SHIFT_SP_RX1_PAGE0ERRIP                16
#define SPORT_BIT_SP_RX1_PAGE0ERRIP                  ((u32)0x00000001 << 16)                             /*!<W 0  RX1 PAGE 0 Error Interrupt Pending. Fabric bus responses DEC/SLV error. 0: No error interrupt 1: Interrupt pending */
#define SPORT_SHIFT_SP_RX1_PAGE3UNAVA_IP             11
#define SPORT_BIT_SP_RX1_PAGE3UNAVA_IP               ((u32)0x00000001 << 11)                             /*!<W 0  RX1 PAGE 3 unavailable Interrupt Pending. The controller wants to execute the page but this page own bit does not be set. This situation will make the interrupt. 0: No Interrupt 1: Interrupt pending, write 1 to clear */
#define SPORT_SHIFT_SP_RX1_PAGE2UNAVA_IP             10
#define SPORT_BIT_SP_RX1_PAGE2UNAVA_IP               ((u32)0x00000001 << 10)                             /*!<W 0  RX1 PAGE 2 unavailable Interrupt Pending. The controller wants to execute the page but this page own bit does not be set. This situation will make the interrupt. 0: No Interrupt 1: Interrupt pending, write 1 to clear */
#define SPORT_SHIFT_SP_RX1_PAGE1UNAVA_IP             9
#define SPORT_BIT_SP_RX1_PAGE1UNAVA_IP               ((u32)0x00000001 << 9)                              /*!<W 0  RX1 PAGE 1 unavailable Interrupt Pending. The controller wants to execute the page but this page own bit does not be set. This situation will make the interrupt. 0: No Interrupt 1: Interrupt pending, write 1 to clear */
#define SPORT_SHIFT_SP_RX1_PAGE0UNAVA_IP             8
#define SPORT_BIT_SP_RX1_PAGE0UNAVA_IP               ((u32)0x00000001 << 8)                              /*!<W 0  RX1 PAGE 0 unavailable Interrupt Pending. The controller wants to execute the page but this page own bit does not be set. This situation will make the interrupt. 0: No Interrupt 1: Interrupt pending, write 1 to clear */
#define SPORT_SHIFT_SP_RX1_P3OKIP                    3
#define SPORT_BIT_SP_RX1_P3OKIP                      ((u32)0x00000001 << 3)                              /*!<W 0  RX1 Page 3 OK Interrupt Pending 0: No Interrupt 1: Interrupt pending, write 1 to clear */
#define SPORT_SHIFT_SP_RX1_P2OKIP                    2
#define SPORT_BIT_SP_RX1_P2OKIP                      ((u32)0x00000001 << 2)                              /*!<W 0  RX1 Page 2 OK Interrupt Pending 0: No Interrupt 1: Interrupt pending, write 1 to clear */
#define SPORT_SHIFT_SP_RX1_P1OKIP                    1
#define SPORT_BIT_SP_RX1_P1OKIP                      ((u32)0x00000001 << 1)                              /*!<W 0  RX1 Page 1 OK Interrupt Pending 0: No Interrupt 1: Interrupt pending, write 1 to clear */
#define SPORT_SHIFT_SP_RX1_P0OKIP                    0
#define SPORT_BIT_SP_RX1_P0OKIP                      ((u32)0x00000001 << 0)                              /*!<W 0  RX1 Page 0 OK Interrupt Pending 0: No Interrupt 1: Interrupt pending, write 1 to clear */
/** @} */

/**************************************************************************//**
 * @defgroup SPORT_SP_RX_PAGE_OWN
 * @brief  SPORT RX Page Own Register                (@ 0X098)
 * @{
 *****************************************************************************/
#define SPORT_SHIFT_SP_RX1_P3OWN                     7
#define SPORT_BIT_SP_RX1_P3OWN                       ((u32)0x00000001 << 7)                              /*!<R/W 0  RX1 Page 3 Own bit 0: Page 0 owned by CPU 1: Page 0 owned by controller DMA sets this bit to 0 when TX channel 0 Page 0 is done */
#define SPORT_SHIFT_SP_RX1_P2OWN                     6
#define SPORT_BIT_SP_RX1_P2OWN                       ((u32)0x00000001 << 6)                              /*!<R/W 0  RX1 Page 2 Own bit 0: Page 0 owned by CPU 1: Page 0 owned by controller DMA sets this bit to 0 when TX channel 0 Page 0 is done */
#define SPORT_SHIFT_SP_RX1_P1OWN                     5
#define SPORT_BIT_SP_RX1_P1OWN                       ((u32)0x00000001 << 5)                              /*!<R/W 0  RX1 Page 1 Own bit 0: Page 0 owned by CPU 1: Page 0 owned by controller DMA sets this bit to 0 when TX channel 0 Page 0 is done */
#define SPORT_SHIFT_SP_RX1_P0OWN                     4
#define SPORT_BIT_SP_RX1_P0OWN                       ((u32)0x00000001 << 4)                              /*!<R/W 0  RX1 Page 0 Own bit 0: Page 0 owned by CPU 1: Page 0 owned by controller DMA sets this bit to 0 when TX channel 0 Page 0 is done */
#define SPORT_SHIFT_SP_RX0_P3OWN                     3
#define SPORT_BIT_SP_RX0_P3OWN                       ((u32)0x00000001 << 3)                              /*!<R/W 0  RX0 Page 3 Own bit 0: Page 0 owned by CPU 1: Page 0 owned by controller DMA sets this bit to 0 when TX channel 0 Page 0 is done */
#define SPORT_SHIFT_SP_RX0_P2OWN                     2
#define SPORT_BIT_SP_RX0_P2OWN                       ((u32)0x00000001 << 2)                              /*!<R/W 0  RX0 Page 2 Own bit 0: Page 0 owned by CPU 1: Page 0 owned by controller DMA sets this bit to 0 when TX channel 0 Page 0 is done */
#define SPORT_SHIFT_SP_RX0_P1OWN                     1
#define SPORT_BIT_SP_RX0_P1OWN                       ((u32)0x00000001 << 1)                              /*!<R/W 0  RX0 Page 1 Own bit 0: Page 0 owned by CPU 1: Page 0 owned by controller DMA sets this bit to 0 when TX channel 0 Page 0 is done */
#define SPORT_SHIFT_SP_RX0_P0OWN                     0
#define SPORT_BIT_SP_RX0_P0OWN                       ((u32)0x00000001 << 0)                              /*!<R/W 0  RX0 Page 0 Own bit 0: Page 0 owned by CPU 1: Page 0 owned by controller DMA sets this bit to 0 when TX channel 0 Page 0 is done */
/** @} */

/**************************************************************************//**
 * @defgroup SPORT_SP_TX_AXIADDR_ERR
 * @brief  SPORT TX AXI address access Error address record Register (@ 0X09C)
 * @{
 *****************************************************************************/
#define SPORT_SHIFT_SP_TX_AXIADDR                    0
#define SPORT_MASK_SP_TX_AXIADDR                     ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  TX AXI Error Address cause Error interruptlimitation. */
/** @} */

/**************************************************************************//**
 * @defgroup SPORT_SP_TX_MISC_ERR
 * @brief  SPORT TX AXI MISC. access Error record Register (@ 0X100)
 * @{
 *****************************************************************************/
#define SPORT_SHIFT_SP_TX_CURRENT_PAGE               29
#define SPORT_MASK_SP_TX_CURRENT_PAGE                ((u32)0x00000003 << 29)                             /*!<R 0  Current page has Error 00: page 0 01: page 1 10: page 2 11: page 3 */
#define SPORT_SHIFT_SP_TX_CHANNEL_WINNER             27
#define SPORT_BIT_SP_TX_CHANNEL_WINNER               ((u32)0x00000001 << 27)                             /*!<R 0  Channel that is served by DMA 0: Channel 0 1: Channel 1 */
#define SPORT_SHIFT_SP_TX_BURST_LEN_SETTING          24
#define SPORT_MASK_SP_TX_BURST_LEN_SETTING           ((u32)0x00000003 << 24)                             /*!<R 0  Burst length setting in DMA_CTRL = 1 */
#define SPORT_SHIFT_SP_TX_DMA_CTRL                   23
#define SPORT_BIT_SP_TX_DMA_CTRL                     ((u32)0x00000001 << 23)                             /*!<R 0  DMA Burst length calculation 0: Self-calculation 1: Burst length info from setting (refer to BURST_LEN_SETTING field) */
#define SPORT_SHIFT_SP_TX_BURST_LEN                  16
#define SPORT_MASK_SP_TX_BURST_LEN                   ((u32)0x0000000F << 16)                             /*!<R 0  TX AXI Burst Length Error transaction causes Error interrupt */
#define SPORT_SHIFT_SP_TX_PAGE_NUM                   12
#define SPORT_MASK_SP_TX_PAGE_NUM                    ((u32)0x00000003 << 12)                             /*!<R 0  Number of page setting */
#define SPORT_SHIFT_SP_TX_PAGE_SIZE                  0
#define SPORT_MASK_SP_TX_PAGE_SIZE                   ((u32)0x00000FFF << 0)                              /*!<R 0  Page Size setting */
/** @} */

/**************************************************************************//**
 * @defgroup SPORT_SP_RX_AXIADDR_ERR
 * @brief  SPORT RX AXI address access Error address record Register (@ 0X104)
 * @{
 *****************************************************************************/
#define SPORT_SHIFT_SP_RX_AXIADDR                    0
#define SPORT_MASK_SP_RX_AXIADDR                     ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  RX AXI Error Address cause Error interruptlimitation. */
/** @} */

/**************************************************************************//**
 * @defgroup SPORT_SP_RX_MISC_ERR
 * @brief  SPORT RX AXI MISC. access Error record Register (@ 0X108)
 * @{
 *****************************************************************************/
#define SPORT_SHIFT_SP_RX_CURRENT_PAGE               29
#define SPORT_MASK_SP_RX_CURRENT_PAGE                ((u32)0x00000003 << 29)                             /*!<R 0  Current page has Error 00: page 0 01: page 1 10: page 2 11: page 3 */
#define SPORT_SHIFT_SP_RX_CHANNEL_WINNER             27
#define SPORT_BIT_SP_RX_CHANNEL_WINNER               ((u32)0x00000001 << 27)                             /*!<R 0  Channel that is served by DMA 0: Channel 0 1: Channel 1 */
#define SPORT_SHIFT_SP_RX_BURST_LEN_SETTING          24
#define SPORT_MASK_SP_RX_BURST_LEN_SETTING           ((u32)0x00000003 << 24)                             /*!<R 0  Burst length setting in DMA_CTRL = 1 */
#define SPORT_SHIFT_SP_RX_DMA_CTRL                   23
#define SPORT_BIT_SP_RX_DMA_CTRL                     ((u32)0x00000001 << 23)                             /*!<R 0  DMA Burst length calculation 0: Self-calculation 1: Burst length info from setting (refer to BURST_LEN_SETTING field) */
#define SPORT_SHIFT_SP_RX_BURST_LEN                  16
#define SPORT_MASK_SP_RX_BURST_LEN                   ((u32)0x0000000F << 16)                             /*!<R 0  TX AXI Burst Length Error transaction causes Error interrupt */
#define SPORT_SHIFT_SP_RX_PAGE_NUM                   12
#define SPORT_MASK_SP_RX_PAGE_NUM                    ((u32)0x00000003 << 12)                             /*!<R 0  Number of page setting */
#define SPORT_SHIFT_SP_RX_PAGE_SIZE                  0
#define SPORT_MASK_SP_RX_PAGE_SIZE                   ((u32)0x00000FFF << 0)                              /*!<R 0  Page Size setting */
/** @} */

