Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_sport_type.h
/**************************************************************************//**
 * @defgroup rtl8735b_SPORT
 * @{
 * @brief rtl8735b_SPORT Register Declaration
 *****************************************************************************/
typedef struct {
	__O  uint32_t SPORT_SP_TX_FIFO_0 ;                     /*!<  SPORT TX FIFO Register register,  Address offset: 0x000 */
	__IO uint32_t SPORT_SP_CON ;                           /*!<  SPORT Control Register register,  Address offset: 0x004 */
	__IO uint32_t SPORT_SP_FIFO_EN_CLK_CON ;               /*!<   SPORT FIFO Enable and Clock Control Register register,  Address offset: 0x008 */
	__IO uint32_t SPORT_SP_FIFO_INTR_CON ;                 /*!<  SPORT FIFO Interrupt Control Register register,  Address offset: 0x00C */
	__I  uint32_t SPORT_SP_RX_FIFO_0 ;                     /*!<  SPORT RX FIFO_0 Register register,  Address offset: 0x010 */
	__I  uint32_t SPORT_SP_FIFO_CNT_STA ;                  /*!<  SPORT FIFO Counter Status Register register,  Address offset: 0x014 */
	__I  uint32_t SPORT_SP_TX_RX_ERR_STA ;                 /*!<  SPORT TX and RX Error Status Register register,  Address offset: 0x018 */
	__IO uint32_t SPORT_SP_TX_FRA_DIV ;                    /*!<  SPORT TX Fractional Divider Register register,  Address offset: 0x01C */
	__IO uint32_t SPORT_SP_LRCK_FIFO_TH_CON ;              /*!<   SPORT LRCK and FIFO Threshold Control Register register,  Address offset: 0x020 */
	__I  uint32_t SPORT_SP_FIFO_INTR_STA ;                 /*!<  SPORT FIFO Interrupt Status Register register,  Address offset: 0x024 */
	__IO uint32_t SPORT_SP_FORM_CON ;                      /*!<   SPORT Format Control register,  Address offset: 0x028 */
	__IO uint32_t SPORT_SP_RX_FRA_DIV ;                    /*!<  SPORT RX Fractional Divider Register register,  Address offset: 0x02C */
	__I  uint32_t SPORT_SP_RSVD_0 ;                        /*!<  SPORT Reserve Register 0 register,  Address offset: 0x030 */
	__I  uint32_t SPORT_SP_RSVD_1 ;                        /*!<  SPORT Reserve Register 1 register,  Address offset: 0x034 */
	__I  uint32_t SPORT_SP_RSVD_2 ;                        /*!<  SPORT Reserve Register 2 register,  Address offset: 0x038 */
	__IO uint32_t SPORT_SP_TX_SLOT_SELE ;                  /*!<  SPORT TX Slot Selection Register register,  Address offset: 0x03C */
	__O  uint32_t SPORT_SP_TX_FIFO_1 ;                     /*!<  SPORT TX FIFO_1 Register register,  Address offset: 0x040 */
	__IO uint32_t SPORT_SP_TX1_RX1_DAT_CON ;               /*!<  SPORT TX1 and RX1 Data Control Register register,  Address offset: 0x044 */
	__IO uint32_t SPORT_SP_TX1_RX1_FORM_CON ;              /*!<   SPORT TX1 and RX1 Format Control Register register,  Address offset: 0x048 */
	__I  uint32_t SPORT_SP_RSVD_3 ;                        /*!<  SPORT Reserve Register 3 register,  Address offset: 0x04C */
	__I  uint32_t SPORT_SP_RX_FIFO_1 ;                     /*!<  SPORT RX FIFO_1 Register register,  Address offset: 0x050 */
	__IO uint32_t SPORT_SP_RX_SLOT_SELE_0_3CH ;            /*!<  SPORT RX Slot Selection 0-3 Channel Register register,  Address offset: 0x054 */
	__IO uint32_t SPORT_SP_RX_SLOT_SELE_4_7CH ;            /*!<  SPORT RX Slot Selection 4-7 Channel Register register,  Address offset: 0x058 */
	__IO uint32_t SPORT_SP_ERR_CNT_CON ;                   /*!<  SPORT Error Count Control Register register,  Address offset: 0x05C */
	__IO uint32_t SPORT_SP_DMA_CON ;                       /*!<  SPORT DMA Control Register register,  Address offset: 0x060 */
	__IO uint32_t SPORT_SP_TX0_DMA_PP ;                    /*!<  SPORT TX0 DMA Page Pointer Register register,  Address offset: 0x064 */
	__IO uint32_t SPORT_SP_TX0_DMA_INT_EN ;                /*!<  SPORT TX0 DMA Interrupt Enable Register register,  Address offset: 0x068 */
	__O  uint32_t SPORT_SP_TX0_DMA_INT_STA ;               /*!<  SPORT TX0 DMA Interrupt Status Register register,  Address offset: 0x06C */
	__IO uint32_t SPORT_SP_TX1_DMA_PP ;                    /*!<  SPORT TX1 DMA Page Pointer Register register,  Address offset: 0x070 */
	__IO uint32_t SPORT_SP_TX1_DMA_INT_EN ;                /*!<  SPORT TX1 DMA Interrupt Enable Register register,  Address offset: 0x074 */
	__O  uint32_t SPORT_SP_TX1_DMA_INT_STA ;               /*!<  SPORT TX1 DMA Interrupt Status Register register,  Address offset: 0x078 */
	__IO uint32_t SPORT_SP_TX_PAGE_OWN ;                   /*!<  SPORT TX Page Own Register register,  Address offset: 0x07C */
	__IO uint32_t SPORT_SP_RX0_DMA_PP ;                    /*!<  SPORT RX0 DMA Page Pointer Register register,  Address offset: 0x080 */
	__IO uint32_t SPORT_SP_RX0_DMA_INT_EN ;                /*!<  SPORT RX0 DMA Interrupt Enable Register register,  Address offset: 0x084 */
	__O  uint32_t SPORT_SP_RX0_DMA_INT_STA ;               /*!<  SPORT RX0 DMA Interrupt Status Register register,  Address offset: 0x088 */
	__IO uint32_t SPORT_SP_RX1_DMA_PP ;                    /*!<  SPORT RX1 DMA Page Pointer Register register,  Address offset: 0x08C */
	__IO uint32_t SPORT_SP_RX1_DMA_INT_EN ;                /*!<  SPORT RX1 DMA Interrupt Enable Register register,  Address offset: 0x090 */
	__O  uint32_t SPORT_SP_RX1_DMA_INT_STA ;               /*!<  SPORT RX1 DMA Interrupt Status Register register,  Address offset: 0x094 */
	__IO uint32_t SPORT_SP_RX_PAGE_OWN ;                   /*!<  SPORT RX Page Own Register register,  Address offset: 0x098 */
	__IO uint32_t SPORT_SP_TX_AXIADDR_ERR ;                /*!<  SPORT TX AXI address access Error address record Register register,  Address offset: 0x09C */
	__IO uint32_t RSVD0[24];                               /*!<  Reserved,  Address offset:0xA0-0xFC */
	__I  uint32_t SPORT_SP_TX_MISC_ERR ;                   /*!<  SPORT TX AXI MISC. access Error record Register register,  Address offset: 0x100 */
	__IO uint32_t SPORT_SP_RX_AXIADDR_ERR ;                /*!<  SPORT RX AXI address access Error address record Register register,  Address offset: 0x104 */
	__I  uint32_t SPORT_SP_RX_MISC_ERR ;                   /*!<  SPORT RX AXI MISC. access Error record Register register,           Address offset: 0x108 */
} SPORT_TypeDef;
/** @} */

#endif
